(function(){
	let emojies = [
		{
			"title": "Смайлики",
			"id": "smiles",
			"icons": [
				{
					"title": "Ухмыляющееся лицо",
					"value": "&#128512;"
				},
				{
					"title": "Улыбающееся лицо\nс открытым ртом",
					"value": "&#128515;"
				},
				{
					"title": "Улыбающееся лицо\nс открытым ртом\nи улыбающимися глазами",
					"value": "&#128516;"
				},
				{
					"title": "Ухмыляющееся лицо\nс улыбающимися глазами",
					"value": "&#128513;"
				},
				{
					"title": "Улыбающееся лицо\nс открытым ртом\nи плотно закрытыми глазами",
					"value": "&#128518;"
				},
				{
					"title": "Улыбающееся лицо\nс открытым ртом\nи холодным потом",
					"value": "&#128517;"
				},
				{
					"title": "Катаюсь по полу от смеха",
					"value": "&#129315;"
				},
				{
					"title": "Лицо со слезами радости",
					"value": "&#128514;"
				},
				{
					"title": "Слегка улыбающееся лицо",
					"value": "&#128578;"
				},
				{
					"title": "Перевернутое лицо",
					"value": "&#128579;"
				},
				{
					"title": "Подмигивающее лицо",
					"value": "&#128521;"
				},
				{
					"title": "Улыбающееся лицо\nс улыбающимися глазами",
					"value": "&#128522;"
				},
				{
					"title": "Улыбающееся лицо\nс нимбом",
					"value": "&#128519;"
				},
				{
					"title": "Улыбающееся лицо\nс улыбающимися глазами\nи тремя сердцами",
					"value": "&#129392;"
				},
				{
					"title": "Улыбающееся лицо\nс глазами в форме сердечек",
					"value": "&#128525;"
				},
				{
					"title": "Ухмыляющееся лицо\nсо звездными глазами",
					"value": "&#129321;"
				},
				{
					"title": "Лицо, посылающее поцелуй",
					"value": "&#128536;"
				},
				{
					"title": "Целующее лицо",
					"value": "&#128535;"
				},
				{
					"title": "Белое улыбающееся лицо",
					"value": "&#9786;"
				},
				{
					"title": "Целующее лицо\nс закрытыми глазами",
					"value": "&#128538;"
				},
				{
					"title": "Целующее лицо\nс улыбающимися глазами",
					"value": "&#128537;"
				},
				{
					"title": "Лицо, наслаждающееся вкусной едой",
					"value": "&#128523;"
				},
				{
					"title": "Лицо с высунутым языком",
					"value": "&#128539;"
				},
				{
					"title": "Лицо с высунутым языком\nи подмигивающим глазом",
					"value": "&#128540;"
				},
				{
					"title": "Ухмыляющееся лицо\nс одним большим\nи одним маленьким глазом",
					"value": "&#129322;"
				},
				{
					"title": "Лицо с высунутым языком\nи плотно закрытыми глазами",
					"value": "&#128541;"
				},
				{
					"title": "Лицо с денежным ртом",
					"value": "&#129297;"
				},
				{
					"title": "Обнимающее лицо",
					"value": "&#129303;"
				},
				{
					"title": "Улыбающееся лицо\nс улыбающимися глазами\nи рукой, закрывающей рот",
					"value": "&#129325;"
				},
				{
					"title": "Лицо с закрытыми губами,\nприкрытыми пальцем",
					"value": "&#129323;"
				},
				{
					"title": "Думающее лицо",
					"value": "&#129300;"
				},
				{
					"title": "Лицо с застежкой-молнией",
					"value": "&#129296;"
				},
				{
					"title": "Лицо с поднятой бровью",
					"value": "&#129320;"
				},
				{
					"title": "Нейтральное лицо",
					"value": "&#128528;"
				},
				{
					"title": "Лицо без выражения",
					"value": "&#128529;"
				},
				{
					"title": "Лицо без рта",
					"value": "&#128566;"
				},
				{
					"title": "Ухмыляющееся лицо",
					"value": "&#128527;"
				},
				{
					"title": "Невеселое лицо",
					"value": "&#128530;"
				},
				{
					"title": "Лицо с закатанными глазами",
					"value": "&#128580;"
				},
				{
					"title": "Гримасничающее лицо",
					"value": "&#128556;"
				},
				{
					"title": "Лживое лицо",
					"value": "&#129317;"
				},
				{
					"title": "Лицо с облегчением",
					"value": "&#128524;"
				},
				{
					"title": "Задумчивое лицо",
					"value": "&#128532;"
				},
				{
					"title": "Сонное лицо",
					"value": "&#128554;"
				},
				{
					"title": "Слюнявое лицо",
					"value": "&#129316;"
				},
				{
					"title": "Спящее лицо",
					"value": "&#128564;"
				},
				{
					"title": "Лицо с медицинской маской",
					"value": "&#128567;"
				},
				{
					"title": "Лицо с термометром",
					"value": "&#129298;"
				},
				{
					"title": "Лицо с повязкой на голове",
					"value": "&#129301;"
				},
				{
					"title": "Тошнотворное лицо",
					"value": "&#129314;"
				},
				{
					"title": "Лицо с открытым ртом, рвота",
					"value": "&#129326;"
				},
				{
					"title": "Чихающее лицо",
					"value": "&#129319;"
				},
				{
					"title": "Перегретое лицо",
					"value": "&#129397;"
				},
				{
					"title": "Замораживающее лицо",
					"value": "&#129398;"
				},
				{
					"title": "Лицо с неровными глазами\nи волнистым ртом",
					"value": "&#129396;"
				},
				{
					"title": "Головокружительное лицо",
					"value": "&#128565;"
				},
				{
					"title": "Шокированное лицо\nсо взрывающейся головой",
					"value": "&#129327;"
				},
				{
					"title": "Лицо в ковбойской шляпе",
					"value": "&#129312;"
				},
				{
					"title": "Лицо с праздничным рожком\nи праздничной шляпой",
					"value": "&#129395;"
				},
				{
					"title": "Улыбающееся лицо\nв солнцезащитных очках",
					"value": "&#128526;"
				},
				{
					"title": "Лицо задрота",
					"value": "&#129299;"
				},
				{
					"title": "Лицо с моноклем",
					"value": "&#129488;"
				},
				{
					"title": "Смущенное лицо",
					"value": "&#128533;"
				},
				{
					"title": "Обеспокоенное лицо",
					"value": "&#128543;"
				},
				{
					"title": "Слегка нахмуренное лицо",
					"value": "&#128577;"
				},
				{
					"title": "Хмурое лицо",
					"value": "&#9785;"
				},
				{
					"title": "Лицо с открытым ртом",
					"value": "&#128558;"
				},
				{
					"title": "Молчаливое лицо",
					"value": "&#128559;"
				},
				{
					"title": "Удивленное лицо",
					"value": "&#128562;"
				},
				{
					"title": "Покрасневшее лицо",
					"value": "&#128563;"
				},
				{
					"title": "Лицо с умоляющими глазами",
					"value": "&#129402;"
				},
				{
					"title": "Нахмуренное лицо с открытым ртом",
					"value": "&#128550;"
				},
				{
					"title": "Страдающее лицо",
					"value": "&#128551;"
				},
				{
					"title": "Испуганное лицо",
					"value": "&#128552;"
				},
				{
					"title": "Лицо с открытым ртом и холодным потом",
					"value": "&#128560;"
				},
				{
					"title": "Разочарованное, но облегченное лицо",
					"value": "&#128549;"
				},
				{
					"title": "Плачущее лицо",
					"value": "&#128546;"
				},
				{
					"title": "Громко плачущее лицо",
					"value": "&#128557;"
				},
				{
					"title": "Лицо кричит от страха",
					"value": "&#128561;"
				},
				{
					"title": "Смущенное лицо",
					"value": "&#128534;"
				},
				{
					"title": "Настойчивое лицо",
					"value": "&#128547;"
				},
				{
					"title": "Разочарованное лицо",
					"value": "&#128542;"
				},
				{
					"title": "Лицо в холодном поту",
					"value": "&#128531;"
				},
				{
					"title": "Усталое лицо",
					"value": "&#128553;"
				},
				{
					"title": "Усталое лицо",
					"value": "&#128555;"
				},
				{
					"title": "Лицо с выражением триумфа",
					"value": "&#128548;"
				},
				{
					"title": "Надутое лицо",
					"value": "&#128545;"
				},
				{
					"title": "Сердитое лицо",
					"value": "&#128544;"
				},
				{
					"title": "Серьёзное лицо с символами\nзакрывающими рот",
					"value": "&#129324;"
				},
				{
					"title": "Улыбающееся лицо с рогами",
					"value": "&#128520;"
				},
				{
					"title": "Чертенок",
					"value": "&#128127;"
				},
				{
					"title": "Череп",
					"value": "&#128128;"
				},
				{
					"title": "Череп и скрещенные кости",
					"value": "&#9760;"
				},
				{
					"title": "Куча какашек",
					"value": "&#128169;"
				},
				{
					"title": "Лицо клоуна",
					"value": "&#129313;"
				},
				{
					"title": "Японский огр",
					"value": "&#128121;"
				},
				{
					"title": "Японский гоблин",
					"value": "&#128122;"
				},
				{
					"title": "Призрак",
					"value": "&#128123;"
				},
				{
					"title": "Внеземной пришелец",
					"value": "&#128125;"
				},
				{
					"title": "Чужой монстр",
					"value": "&#128126;"
				},
				{
					"title": "Лицо робота",
					"value": "&#129302;"
				},
				{
					"title": "Улыбающееся кошачье лицо\nс открытым ртом",
					"value": "&#128570;"
				},
				{
					"title": "Ухмыляющаяся морда кошки\nс улыбающимися глазами",
					"value": "&#128568;"
				},
				{
					"title": "Кошачья морда\nсо слезами радости",
					"value": "&#128569;"
				},
				{
					"title": "Улыбающаяся мордашка кота\nс глазами в форме сердечек",
					"value": "&#128571;"
				},
				{
					"title": "Кошачья морда\nс кривой улыбкой",
					"value": "&#128572;"
				},
				{
					"title": "Целующая мордашка кошки\nс закрытыми глазами",
					"value": "&#128573;"
				},
				{
					"title": "Усталое кошачье лицо",
					"value": "&#128576;"
				},
				{
					"title": "Плачущая морда кошки",
					"value": "&#128575;"
				},
				{
					"title": "Надутая морда кошки",
					"value": "&#128574;"
				},
				{
					"title": "Обезьяна, не видящая зла",
					"value": "&#128584;"
				},
				{
					"title": "Обезьяна, не слышащая зла",
					"value": "&#128585;"
				},
				{
					"title": "Обезьяна, не говорящая зла",
					"value": "&#128586;"
				}
			]
		},
		{
			"title": "Эмоции",
			"id": "emotics",
			"icons": [
				{
					"title": "Поцелуй",
					"value": "&#128139;"
				},
				{
					"title": "Любовное письмо",
					"value": "&#128140;"
				},
				{
					"title": "Сердце со стрелой",
					"value": "&#128152;"
				},
				{
					"title": "Сердце с лентой",
					"value": "&#128157;"
				},
				{
					"title": "Сверкающее Сердце",
					"value": "&#128150;"
				},
				{
					"title": "Растущее сердце",
					"value": "&#128151;"
				},
				{
					"title": "Бьющееся Сердце",
					"value": "&#128147;"
				},
				{
					"title": "Вращающиеся сердца",
					"value": "&#128158;"
				},
				{
					"title": "Два Сердца",
					"value": "&#128149;"
				},
				{
					"title": "Украшение в виде сердца",
					"value": "&#128159;"
				},
				{
					"title": "Cердце с восклицательным знаком",
					"value": "&#10083;"
				},
				{
					"title": "Разбитое Сердце",
					"value": "&#128148;"
				},
				{
					"title": "Сердце",
					"value": "&#10084;"
				},
				{
					"title": "Оранжевое Сердце",
					"value": "&#129505;"
				},
				{
					"title": "Жёлтое Сердце",
					"value": "&#128155;"
				},
				{
					"title": "Зелёное Сердце",
					"value": "&#128154;"
				},
				{
					"title": "Синее Сердце",
					"value": "&#128153;"
				},
				{
					"title": "Фиолетовое Сердце",
					"value": "&#128156;"
				},
				{
					"title": "Чёрное Сердце",
					"value": "&#128420;"
				},
				{
					"title": "Символ 100 очков",
					"value": "&#128175;"
				},
				{
					"title": "Символ гнева",
					"value": "&#128162;"
				},
				{
					"title": "Символ столкновения",
					"value": "&#128165;"
				},
				{
					"title": "Символ головокружения",
					"value": "&#128171;"
				},
				{
					"title": "Символ брызг пота",
					"value": "&#128166;"
				},
				{
					"title": "Символ Ветер",
					"value": "&#128168;"
				},
				{
					"title": "Дыра",
					"value": "&#128371;"
				},
				{
					"title": "Бомба",
					"value": "&#128163;"
				},
				{
					"title": "Выноска с речью",
					"value": "&#128172;"
				},
				{
					"title": "Левый речевой пузырь",
					"value": "&#128488;"
				},
				{
					"title": "Правильный пузырь гнева",
					"value": "&#128495;"
				},
				{
					"title": "Мыслительный шар",
					"value": "&#128173;"
				},
				{
					"title": "Спящий Символ",
					"value": "&#128164;"
				}
			]
		},
		{
			"title": "Люди",
			"id": "people",
			"icons": [
				{
					"title": "Машущая рука",
					"value": "&#128075;"
				},
				{
					"title": "Поднятая тыльная сторона руки",
					"value": "&#129306;"
				},
				{
					"title": "Поднятая рука с растопыренными пальцами",
					"value": "&#128400;"
				},
				{
					"title": "Поднятая рука",
					"value": "&#9995;"
				},
				{
					"title": "Поднятая рука с пробором между средним\nи безымянным пальцами",
					"value": "&#128406;"
				},
				{
					"title": "Знак рукой «ОК»",
					"value": "&#128076;"
				},
				{
					"title": "Знак рукой «Победа»",
					"value": "&#9996;"
				},
				{
					"title": "Рука со скрещенными указательным\nи средним пальцами",
					"value": "&#129310;"
				},
				{
					"title": "Я люблю тебя жест рукой",
					"value": "&#129311;"
				},
				{
					"title": "Знак Рогов",
					"value": "&#129304;"
				},
				{
					"title": "Знак рукой «Позвони мне»",
					"value": "&#129305;"
				},
				{
					"title": "Тыльная сторона руки\nУказательный палец влево",
					"value": "&#128072;"
				},
				{
					"title": "Тыльная сторона руки\nУказательный палец вправо",
					"value": "&#128073;"
				},
				{
					"title": "Тыльная сторона руки\nУказательный палец вверх",
					"value": "&#128070;"
				},
				{
					"title": "Тыльная сторона руки\nс вытянутым средним пальцем",
					"value": "&#128405;"
				},
				{
					"title": "Тыльная сторона руки\nУказательный палец вниз",
					"value": "&#128071;"
				},
				{
					"title": "Указательный палец вверх",
					"value": "&#9757;"
				},
				{
					"title": "Большой палец вверх",
					"value": "&#128077;"
				},
				{
					"title": "Большой палец вниз",
					"value": "&#128078;"
				},
				{
					"title": "Поднятый кулак",
					"value": "&#9994;"
				},
				{
					"title": "Знак сжатой в кулак руки",
					"value": "&#128074;"
				},
				{
					"title": "Кулак, обращенный влево",
					"value": "&#129307;"
				},
				{
					"title": "Кулак, обращенный вправо",
					"value": "&#129308;"
				},
				{
					"title": "Знак хлопающих рук",
					"value": "&#128079;"
				},
				{
					"title": "Человек, поднявший обе руки в знак празднования",
					"value": "&#128588;"
				},
				{
					"title": "Знак «Открытые руки»",
					"value": "&#128080;"
				},
				{
					"title": "Ладони вверх вместе",
					"value": "&#129330;"
				},
				{
					"title": "Рукопожатие",
					"value": "&#129309;"
				},
				{
					"title": "Человек со сложенными руками",
					"value": "&#128591;"
				},
				{
					"title": "Пишущая рука",
					"value": "&#9997;"
				},
				{
					"title": "Маникюр, Лак для ногтей",
					"value": "&#128133;"
				},
				{
					"title": "Селфи",
					"value": "&#129331;"
				},
				{
					"title": "Согнутые бицепсы",
					"value": "&#128170;"
				},
				{
					"title": "Нога",
					"value": "&#129461;"
				},
				{
					"title": "Ступня",
					"value": "&#129462;"
				},
				{
					"title": "Ухо",
					"value": "&#128066;"
				},
				{
					"title": "Нос",
					"value": "&#128067;"
				},
				{
					"title": "Мозг",
					"value": "&#129504;"
				},
				{
					"title": "Зуб",
					"value": "&#129463;"
				},
				{
					"title": "Кость",
					"value": "&#129460;"
				},
				{
					"title": "Глаза",
					"value": "&#128064;"
				},
				{
					"title": "Глаз",
					"value": "&#128065;"
				},
				{
					"title": "Язык",
					"value": "&#128069;"
				},
				{
					"title": "Рот",
					"value": "&#128068;"
				},
				{
					"title": "Младенец",
					"value": "&#128118;"
				},
				{
					"title": "Ребёнок",
					"value": "&#129490;"
				},
				{
					"title": "Мальчик",
					"value": "&#128102;"
				},
				{
					"title": "Девочка",
					"value": "&#128103;"
				},
				{
					"title": "Взрослый",
					"value": "&#129489;"
				},
				{
					"title": "Человек со светлыми волосами",
					"value": "&#128113;"
				},
				{
					"title": "Мужчина",
					"value": "&#128104;"
				},
				{
					"title": "Бородатый Человек",
					"value": "&#129492;"
				},
				{
					"title": "Женщина",
					"value": "&#128105;"
				},
				{
					"title": "Пожилой взрослый",
					"value": "&#129491;"
				},
				{
					"title": "Пожилой мужчина",
					"value": "&#128116;"
				},
				{
					"title": "Пожилая женщина",
					"value": "&#128117;"
				},
				{
					"title": "Человек хмурится",
					"value": "&#128589;"
				},
				{
					"title": "Человек с надутым лицом",
					"value": "&#128590;"
				},
				{
					"title": "Лицо без хорошего жеста",
					"value": "&#128581;"
				},
				{
					"title": "Лицо с жестом «ОК»",
					"value": "&#128582;"
				},
				{
					"title": "Сотрудник информационного бюро",
					"value": "&#128129;"
				},
				{
					"title": "Счастливый человек, поднявший одну руку",
					"value": "&#128587;"
				},
				{
					"title": "Человек, низко кланяющийся",
					"value": "&#128583;"
				},
				{
					"title": "Лицо Ладонь",
					"value": "&#129318;"
				},
				{
					"title": "Пожимание плечами",
					"value": "&#129335;"
				},
				{
					"title": "Полицейский",
					"value": "&#128110;"
				},
				{
					"title": "Детектив или шпион",
					"value": "&#128373;"
				},
				{
					"title": "Гвардеец",
					"value": "&#128130;"
				},
				{
					"title": "Строительный рабочий",
					"value": "&#128119;"
				},
				{
					"title": "Принц",
					"value": "&#129332;"
				},
				{
					"title": "Принцесса",
					"value": "&#128120;"
				},
				{
					"title": "Мужчина в тюрбане",
					"value": "&#128115;"
				},
				{
					"title": "Мужчина с Гуа Пи Мао",
					"value": "&#128114;"
				},
				{
					"title": "Человек в платке",
					"value": "&#129493;"
				},
				{
					"title": "Мужчина в смокинге",
					"value": "&#129333;"
				},
				{
					"title": "Невеста с вуалью",
					"value": "&#128112;"
				},
				{
					"title": "Беременная Женщина",
					"value": "&#129328;"
				},
				{
					"title": "Кормление грудью",
					"value": "&#129329;"
				},
				{
					"title": "Малыш-ангелочек",
					"value": "&#128124;"
				},
				{
					"title": "Дед Мороз",
					"value": "&#127877;"
				},
				{
					"title": "Мать Рождество",
					"value": "&#129334;"
				},
				{
					"title": "Супергерой",
					"value": "&#129464;"
				},
				{
					"title": "Суперзлодей",
					"value": "&#129465;"
				},
				{
					"title": "Маг",
					"value": "&#129497;"
				},
				{
					"title": "Фея",
					"value": "&#129498;"
				},
				{
					"title": "Вампир",
					"value": "&#129499;"
				},
				{
					"title": "Мерперсон. Русалка",
					"value": "&#129500;"
				},
				{
					"title": "Эльф",
					"value": "&#129501;"
				},
				{
					"title": "Джин",
					"value": "&#129502;"
				},
				{
					"title": "Зомби",
					"value": "&#129503;"
				},
				{
					"title": "Массаж лица",
					"value": "&#128134;"
				},
				{
					"title": "Стрижка",
					"value": "&#128135;"
				},
				{
					"title": "Пешеход",
					"value": "&#128694;"
				},
				{
					"title": "Бегун",
					"value": "&#127939;"
				},
				{
					"title": "Танцор",
					"value": "&#128131;"
				},
				{
					"title": "Мужчина танцует",
					"value": "&#128378;"
				},
				{
					"title": "Мужчина в деловом костюме левитирует",
					"value": "&#128372;"
				},
				{
					"title": "Женщина с кроличьими ушками",
					"value": "&#128111;"
				},
				{
					"title": "Человек в парной",
					"value": "&#129494;"
				},
				{
					"title": "Человек поднимающийся",
					"value": "&#129495;"
				},
				{
					"title": "Фехтовальщик",
					"value": "&#129338;"
				},
				{
					"title": "Скачки",
					"value": "&#127943;"
				},
				{
					"title": "Лыжник",
					"value": "&#9975;"
				},
				{
					"title": "Сноубордист",
					"value": "&#127938;"
				},
				{
					"title": "Игрок в гольф",
					"value": "&#127948;"
				},
				{
					"title": "Серфер",
					"value": "&#127940;"
				},
				{
					"title": "Весельная лодка",
					"value": "&#128675;"
				},
				{
					"title": "Пловец",
					"value": "&#127946;"
				},
				{
					"title": "Человек с мячом",
					"value": "&#9977;"
				},
				{
					"title": "Тяжелоатлет",
					"value": "&#127947;"
				},
				{
					"title": "Велосипедист",
					"value": "&#128692;"
				},
				{
					"title": "Горный велосипедист",
					"value": "&#128693;"
				},
				{
					"title": "Человек, делающий колесо",
					"value": "&#129336;"
				},
				{
					"title": "Борцы",
					"value": "&#129340;"
				},
				{
					"title": "Водное поло",
					"value": "&#129341;"
				},
				{
					"title": "Гандбол",
					"value": "&#129342;"
				},
				{
					"title": "Жонглирование",
					"value": "&#129337;"
				},
				{
					"title": "Человек в позе лотоса",
					"value": "&#129496;"
				},
				{
					"title": "Ванна",
					"value": "&#128704;"
				},
				{
					"title": "Размещение в спальных местах",
					"value": "&#128716;"
				},
				{
					"title": "Две женщины держатся за руки",
					"value": "&#128109;"
				},
				{
					"title": "Мужчина и женщина держатся за руки",
					"value": "&#128107;"
				},
				{
					"title": "Двое мужчин держатся за руки",
					"value": "&#128108;"
				},
				{
					"title": "Поцелуи",
					"value": "&#128143;"
				},
				{
					"title": "Пара с сердцем",
					"value": "&#128145;"
				},
				{
					"title": "Семья",
					"value": "&#128106;"
				},
				{
					"title": "Говорящая голова в силуэте",
					"value": "&#128483;"
				},
				{
					"title": "Бюст в силуэте",
					"value": "&#128100;"
				}
			]
		},
		{
			"title": "Животные",
			"id": "animals",
			"icons": [
				{
					"title": "Обезьянье лицо",
					"value": "&#128053;"
				},
				{
					"title": "Обезьяна",
					"value": "&#128018;"
				},
				{
					"title": "Горилла",
					"value": "&#129421;"
				},
				{
					"title": "Лицо собаки",
					"value": "&#128054;"
				},
				{
					"title": "Собака",
					"value": "&#128021;"
				},
				{
					"title": "Пудель",
					"value": "&#128041;"
				},
				{
					"title": "Лицо волка",
					"value": "&#128058;"
				},
				{
					"title": "Лицо лисы",
					"value": "&#129418;"
				},
				{
					"title": "Лицо енота",
					"value": "&#129437;"
				},
				{
					"title": "Лицо кота",
					"value": "&#128049;"
				},
				{
					"title": "Кот",
					"value": "&#128008;"
				},
				{
					"title": "Лицо льва",
					"value": "&#129409;"
				},
				{
					"title": "Лицо тигра",
					"value": "&#128047;"
				},
				{
					"title": "Тигр",
					"value": "&#128005;"
				},
				{
					"title": "Леопард",
					"value": "&#128006;"
				},
				{
					"title": "Лицо лошади",
					"value": "&#128052;"
				},
				{
					"title": "Лошадь",
					"value": "&#128014;"
				},
				{
					"title": "Лицо единорога",
					"value": "&#129412;"
				},
				{
					"title": "Лицо зебры",
					"value": "&#129427;"
				},
				{
					"title": "Олень",
					"value": "&#129420;"
				},
				{
					"title": "Лицо коровы",
					"value": "&#128046;"
				},
				{
					"title": "Бык",
					"value": "&#128002;"
				},
				{
					"title": "Водяной буйвол",
					"value": "&#128003;"
				},
				{
					"title": "Корова",
					"value": "&#128004;"
				},
				{
					"title": "Лицо поросёнка",
					"value": "&#128055;"
				},
				{
					"title": "Поросёнок",
					"value": "&#128022;"
				},
				{
					"title": "Лицо кабана",
					"value": "&#128023;"
				},
				{
					"title": "Пятак поросёнка",
					"value": "&#128061;"
				},
				{
					"title": "Баран",
					"value": "&#128015;"
				},
				{
					"title": "Овца",
					"value": "&#128017;"
				},
				{
					"title": "Козел",
					"value": "&#128016;"
				},
				{
					"title": "Одногорбный верблюд",
					"value": "&#128042;"
				},
				{
					"title": "Двугорбый верблюд",
					"value": "&#128043;"
				},
				{
					"title": "Лама",
					"value": "&#129433;"
				},
				{
					"title": "Лицо жирафа",
					"value": "&#129426;"
				},
				{
					"title": "Слон",
					"value": "&#128024;"
				},
				{
					"title": "Носорог",
					"value": "&#129423;"
				},
				{
					"title": "Бегемот",
					"value": "&#129435;"
				},
				{
					"title": "Лицо мыши",
					"value": "&#128045;"
				},
				{
					"title": "Мышь",
					"value": "&#128001;"
				},
				{
					"title": "Крыса",
					"value": "&#128000;"
				},
				{
					"title": "Лицо хомяка",
					"value": "&#128057;"
				},
				{
					"title": "Лицо зайца",
					"value": "&#128048;"
				},
				{
					"title": "Заяц",
					"value": "&#128007;"
				},
				{
					"title": "Бурундук",
					"value": "&#128063;"
				},
				{
					"title": "Ёж",
					"value": "&#129428;"
				},
				{
					"title": "Летучая мышь",
					"value": "&#129415;"
				},
				{
					"title": "Лицо медведя",
					"value": "&#128059;"
				},
				{
					"title": "Лицо коалы",
					"value": "&#128040;"
				},
				{
					"title": "Лицо панды",
					"value": "&#128060;"
				},
				{
					"title": "Кенгуру",
					"value": "&#129432;"
				},
				{
					"title": "Барсук",
					"value": "&#129441;"
				},
				{
					"title": "Отпечатки лап",
					"value": "&#128062;"
				},
				{
					"title": "Индейка",
					"value": "&#129411;"
				},
				{
					"title": "Курица",
					"value": "&#128020;"
				},
				{
					"title": "Петух",
					"value": "&#128019;"
				},
				{
					"title": "Вылупляющийся цыпленок",
					"value": "&#128035;"
				},
				{
					"title": "Цыпленок",
					"value": "&#128036;"
				},
				{
					"title": "Цыпленок, смотрящий вперед",
					"value": "&#128037;"
				},
				{
					"title": "Птица",
					"value": "&#128038;"
				},
				{
					"title": "Пингвин",
					"value": "&#128039;"
				},
				{
					"title": "Голубь мира",
					"value": "&#128330;"
				},
				{
					"title": "Орел",
					"value": "&#129413;"
				},
				{
					"title": "Утка",
					"value": "&#129414;"
				},
				{
					"title": "Лебедь",
					"value": "&#129442;"
				},
				{
					"title": "Сова",
					"value": "&#129417;"
				},
				{
					"title": "Павлин",
					"value": "&#129434;"
				},
				{
					"title": "Попугай",
					"value": "&#129436;"
				},
				{
					"title": "Лицо лягушки",
					"value": "&#128056;"
				},
				{
					"title": "Крокодил",
					"value": "&#128010;"
				},
				{
					"title": "Черепаха",
					"value": "&#128034;"
				},
				{
					"title": "Ящерица",
					"value": "&#129422;"
				},
				{
					"title": "Змея",
					"value": "&#128013;"
				},
				{
					"title": "Лицо дракона",
					"value": "&#128050;"
				},
				{
					"title": "Дракон",
					"value": "&#128009;"
				},
				{
					"title": "Завропод",
					"value": "&#129429;"
				},
				{
					"title": "Ти-Рекс",
					"value": "&#129430;"
				},
				{
					"title": "Брызгающий кит",
					"value": "&#128051;"
				},
				{
					"title": "Кит",
					"value": "&#128011;"
				},
				{
					"title": "Дельфин",
					"value": "&#128044;"
				},
				{
					"title": "Рыба",
					"value": "&#128031;"
				},
				{
					"title": "Тропическая рыба",
					"value": "&#128032;"
				},
				{
					"title": "Игольчатая рыба",
					"value": "&#128033;"
				},
				{
					"title": "Акула",
					"value": "&#129416;"
				},
				{
					"title": "Осьминог",
					"value": "&#128025;"
				},
				{
					"title": "Спиральная ракушка",
					"value": "&#128026;"
				},
				{
					"title": "Улитка",
					"value": "&#128012;"
				},
				{
					"title": "Бабочка",
					"value": "&#129419;"
				},
				{
					"title": "Гусеница",
					"value": "&#128027;"
				},
				{
					"title": "Муравей",
					"value": "&#128028;"
				},
				{
					"title": "Медоносная пчела",
					"value": "&#128029;"
				},
				{
					"title": "Божья коровка",
					"value": "&#128030;"
				},
				{
					"title": "Сверчёк",
					"value": "&#129431;"
				},
				{
					"title": "Паук",
					"value": "&#128375;"
				},
				{
					"title": "Паутина",
					"value": "&#128376;"
				},
				{
					"title": "Скорпион",
					"value": "&#129410;"
				},
				{
					"title": "Комар",
					"value": "&#129439;"
				},
				{
					"title": "Микроб",
					"value": "&#129440;"
				}
			]
		},
		{
			"title": "Природа",
			"id": "nature",
			"icons": [
				{
					"title": "Букет",
					"value": "&#128144;"
				},
				{
					"title": "Цветущая вишня",
					"value": "&#127800;"
				},
				{
					"title": "Белый Цветок",
					"value": "&#128174;"
				},
				{
					"title": "Розетка листьев",
					"value": "&#127989;"
				},
				{
					"title": "Роза",
					"value": "&#127801;"
				},
				{
					"title": "Увядший цветок",
					"value": "&#129344;"
				},
				{
					"title": "Гибискус",
					"value": "&#127802;"
				},
				{
					"title": "Подсолнух",
					"value": "&#127803;"
				},
				{
					"title": "Белый Цветок",
					"value": "&#127804;"
				},
				{
					"title": "Тюльпан",
					"value": "&#127799;"
				},
				{
					"title": "Рассада",
					"value": "&#127793;"
				},
				{
					"title": "Вечнозеленое дерево",
					"value": "&#127794;"
				},
				{
					"title": "Лиственное дерево",
					"value": "&#127795;"
				},
				{
					"title": "Пальма",
					"value": "&#127796;"
				},
				{
					"title": "Кактус",
					"value": "&#127797;"
				},
				{
					"title": "Рис",
					"value": "&#127806;"
				},
				{
					"title": "Трава",
					"value": "&#127807;"
				},
				{
					"title": "Трилистник",
					"value": "&#9752;"
				},
				{
					"title": "Четырехлистный клевер",
					"value": "&#127808;"
				},
				{
					"title": "Кленовый лист",
					"value": "&#127809;"
				},
				{
					"title": "Опавший лист",
					"value": "&#127810;"
				},
				{
					"title": "Лист трепещет на ветру",
					"value": "&#127811;"
				}
			]
		},
		{
			"title": "Еда и напитки",
			"id": "food",
			"icons": [
				{
					"title": "Виноград",
					"value": "&#127815;"
				},
				{
					"title": "Дыня",
					"value": "&#127816;"
				},
				{
					"title": "Арбуз",
					"value": "&#127817;"
				},
				{
					"title": "Мандарин",
					"value": "&#127818;"
				},
				{
					"title": "Лимон",
					"value": "&#127819;"
				},
				{
					"title": "Банан",
					"value": "&#127820;"
				},
				{
					"title": "Ананас",
					"value": "&#127821;"
				},
				{
					"title": "Манго",
					"value": "&#129389;"
				},
				{
					"title": "Красное яблоко",
					"value": "&#127822;"
				},
				{
					"title": "Зелёное яблоко",
					"value": "&#127823;"
				},
				{
					"title": "Груша",
					"value": "&#127824;"
				},
				{
					"title": "Персик",
					"value": "&#127825;"
				},
				{
					"title": "Вишня",
					"value": "&#127826;"
				},
				{
					"title": "Клубника",
					"value": "&#127827;"
				},
				{
					"title": "Киви",
					"value": "&#129373;"
				},
				{
					"title": "Помидор",
					"value": "&#127813;"
				},
				{
					"title": "Какос",
					"value": "&#129381;"
				},
				{
					"title": "Авокадо",
					"value": "&#129361;"
				},
				{
					"title": "Баклажан",
					"value": "&#127814;"
				},
				{
					"title": "Картофель",
					"value": "&#129364;"
				},
				{
					"title": "Марковка",
					"value": "&#129365;"
				},
				{
					"title": "Кукуруза",
					"value": "&#127805;"
				},
				{
					"title": "Острый перец",
					"value": "&#127798;"
				},
				{
					"title": "Огурец",
					"value": "&#129362;"
				},
				{
					"title": "Листовая зелень",
					"value": "&#129388;"
				},
				{
					"title": "Брокколи",
					"value": "&#129382;"
				},
				{
					"title": "Мухомор",
					"value": "&#127812;"
				},
				{
					"title": "Арахис",
					"value": "&#129372;"
				},
				{
					"title": "Каштан",
					"value": "&#127792;"
				},
				{
					"title": "Хлеб",
					"value": "&#127838;"
				},
				{
					"title": "Круассан",
					"value": "&#129360;"
				},
				{
					"title": "Багетный хлеб",
					"value": "&#129366;"
				},
				{
					"title": "Крендель",
					"value": "&#129384;"
				},
				{
					"title": "Бублик",
					"value": "&#129391;"
				},
				{
					"title": "Блины",
					"value": "&#129374;"
				},
				{
					"title": "Сырный клин",
					"value": "&#129472;"
				},
				{
					"title": "Мясо на кости",
					"value": "&#127830;"
				},
				{
					"title": "Ножка птицы",
					"value": "&#127831;"
				},
				{
					"title": "Кусок мяса",
					"value": "&#129385;"
				},
				{
					"title": "Бекон",
					"value": "&#129363;"
				},
				{
					"title": "Гамбургер",
					"value": "&#127828;"
				},
				{
					"title": "Картофель фри",
					"value": "&#127839;"
				},
				{
					"title": "Кусок пиццы",
					"value": "&#127829;"
				},
				{
					"title": "Хот-дог",
					"value": "&#127789;"
				},
				{
					"title": "Сэндвич",
					"value": "&#129386;"
				},
				{
					"title": "Тако",
					"value": "&#127790;"
				},
				{
					"title": "Буррито",
					"value": "&#127791;"
				},
				{
					"title": "Лепешка с начинкой",
					"value": "&#129369;"
				},
				{
					"title": "Яйцо",
					"value": "&#129370;"
				},
				{
					"title": "Яишница",
					"value": "&#127859;"
				},
				{
					"title": "Неглубокая кастрюля с едой",
					"value": "&#129368;"
				},
				{
					"title": "Горшок с едой",
					"value": "&#127858;"
				},
				{
					"title": "Миска с ложкой",
					"value": "&#129379;"
				},
				{
					"title": "Зеленый салат",
					"value": "&#129367;"
				},
				{
					"title": "Попкорн",
					"value": "&#127871;"
				},
				{
					"title": "Солонка",
					"value": "&#129474;"
				},
				{
					"title": "Консервы",
					"value": "&#129387;"
				},
				{
					"title": "Контейнер",
					"value": "&#127857;"
				},
				{
					"title": "Рисовый крекер",
					"value": "&#127832;"
				},
				{
					"title": "Рисовый шарик",
					"value": "&#127833;"
				},
				{
					"title": "Вареный рис",
					"value": "&#127834;"
				},
				{
					"title": "Карри и рис",
					"value": "&#127835;"
				},
				{
					"title": "Миска для варки на пару",
					"value": "&#127836;"
				},
				{
					"title": "Спагетти",
					"value": "&#127837;"
				},
				{
					"title": "Жареный батат",
					"value": "&#127840;"
				},
				{
					"title": "Оден",
					"value": "&#127842;"
				},
				{
					"title": "Суши",
					"value": "&#127843;"
				},
				{
					"title": "Жареные креветки",
					"value": "&#127844;"
				},
				{
					"title": "Рыбный пирог с завитками",
					"value": "&#127845;"
				},
				{
					"title": "Лунный пирог",
					"value": "&#129390;"
				},
				{
					"title": "Данго",
					"value": "&#127841;"
				},
				{
					"title": "Чебурек",
					"value": "&#129375;"
				},
				{
					"title": "Печенье с предсказанием",
					"value": "&#129376;"
				},
				{
					"title": "Коробка для еды на вынос",
					"value": "&#129377;"
				},
				{
					"title": "Краб",
					"value": "&#129408;"
				},
				{
					"title": "Лобстер",
					"value": "&#129438;"
				},
				{
					"title": "Креветка",
					"value": "&#129424;"
				},
				{
					"title": "Кальмар",
					"value": "&#129425;"
				},
				{
					"title": "Мягкое мороженое",
					"value": "&#127846;"
				},
				{
					"title": "Строганный лед",
					"value": "&#127847;"
				},
				{
					"title": "Мороженое",
					"value": "&#127848;"
				},
				{
					"title": "Пончик",
					"value": "&#127849;"
				},
				{
					"title": "Печенье",
					"value": "&#127850;"
				},
				{
					"title": "Торт на день рождения",
					"value": "&#127874;"
				},
				{
					"title": "Песочное печенье",
					"value": "&#127856;"
				},
				{
					"title": "Кекс",
					"value": "&#129473;"
				},
				{
					"title": "Пирог",
					"value": "&#129383;"
				},
				{
					"title": "Плитка шоколада",
					"value": "&#127851;"
				},
				{
					"title": "Конфеты",
					"value": "&#127852;"
				},
				{
					"title": "Леденец",
					"value": "&#127853;"
				},
				{
					"title": "",
					"value": "&#127854;"
				},
				{
					"title": "Заварной крем",
					"value": "&#127855;"
				},
				{
					"title": "Детская бутылочка",
					"value": "&#127868;"
				},
				{
					"title": "Стакан Молока",
					"value": "&#129371;"
				},
				{
					"title": "Горячий напиток",
					"value": "&#9749;"
				},
				{
					"title": "Чашка без ручки",
					"value": "&#127861;"
				},
				{
					"title": "Бутылка и чашка для сакэ",
					"value": "&#127862;"
				},
				{
					"title": "Шампанское",
					"value": "&#127870;"
				},
				{
					"title": "Бокал вина",
					"value": "&#127863;"
				},
				{
					"title": "Бокал коктейля",
					"value": "&#127864;"
				},
				{
					"title": "Тропический напиток",
					"value": "&#127865;"
				},
				{
					"title": "Кружка пива",
					"value": "&#127866;"
				},
				{
					"title": "Звон пивных кружек",
					"value": "&#127867;"
				},
				{
					"title": "Звон бокалов",
					"value": "&#129346;"
				},
				{
					"title": "Стакан",
					"value": "&#129347;"
				},
				{
					"title": "Чашка с соломинкой",
					"value": "&#129380;"
				},
				{
					"title": "Палочки для еды",
					"value": "&#129378;"
				},
				{
					"title": "Вилка и нож с тарелкой",
					"value": "&#127869;"
				},
				{
					"title": "Вилка и нож",
					"value": "&#127860;"
				},
				{
					"title": "Ложка",
					"value": "&#129348;"
				},
				{
					"title": "Нож",
					"value": "&#128298;"
				},
				{
					"title": "Амфора",
					"value": "&#127994;"
				}
			]
		},
		{
			"title": "Места и путешествия",
			"id": "travel",
			"icons": [
				{
					"title": "Земной шар Европа-Африка",
					"value": "&#127757;"
				},
				{
					"title": "Земной шар Америка",
					"value": "&#127758;"
				},
				{
					"title": "Земной шар Азия-Австралия",
					"value": "&#127759;"
				},
				{
					"title": "Глобус с меридианами",
					"value": "&#127760;"
				},
				{
					"title": "Карта мира",
					"value": "&#128506;"
				},
				{
					"title": "Японские острова",
					"value": "&#128510;"
				},
				{
					"title": "Компас",
					"value": "&#129517;"
				},
				{
					"title": "Заснеженная гора",
					"value": "&#127956;"
				},
				{
					"title": "Гора",
					"value": "&#9968;"
				},
				{
					"title": "Вулкан",
					"value": "&#127755;"
				},
				{
					"title": "Гора Фудзи",
					"value": "&#128507;"
				},
				{
					"title": "Кемпинг",
					"value": "&#127957;"
				},
				{
					"title": "Пляж с зонтиком",
					"value": "&#127958;"
				},
				{
					"title": "Пустыня",
					"value": "&#127964;"
				},
				{
					"title": "Необитаемый остров",
					"value": "&#127965;"
				},
				{
					"title": "Национальный парк",
					"value": "&#127966;"
				},
				{
					"title": "Стадион",
					"value": "&#127967;"
				},
				{
					"title": "Классическое здание",
					"value": "&#127963;"
				},
				{
					"title": "Строительство зданий",
					"value": "&#127959;"
				},
				{
					"title": "Кирпичи",
					"value": "&#129521;"
				},
				{
					"title": "Домашние постройки",
					"value": "&#127960;"
				},
				{
					"title": "Заброшенное здание дома",
					"value": "&#127962;"
				},
				{
					"title": "Строительство дома",
					"value": "&#127968;"
				},
				{
					"title": "Дом с садом",
					"value": "&#127969;"
				},
				{
					"title": "Офисное здание",
					"value": "&#127970;"
				},
				{
					"title": "Почта Японии",
					"value": "&#127971;"
				},
				{
					"title": "Европейская почта",
					"value": "&#127972;"
				},
				{
					"title": "Больница",
					"value": "&#127973;"
				},
				{
					"title": "Банк",
					"value": "&#127974;"
				},
				{
					"title": "Отель",
					"value": "&#127976;"
				},
				{
					"title": "Отель Любви",
					"value": "&#127977;"
				},
				{
					"title": "Магазин у дома",
					"value": "&#127978;"
				},
				{
					"title": "Школа",
					"value": "&#127979;"
				},
				{
					"title": "Универмаг",
					"value": "&#127980;"
				},
				{
					"title": "Фабрика",
					"value": "&#127981;"
				},
				{
					"title": "Японский замок",
					"value": "&#127983;"
				},
				{
					"title": "Европейский замок",
					"value": "&#127984;"
				},
				{
					"title": "Загс",
					"value": "&#128146;"
				},
				{
					"title": "Токийская башня",
					"value": "&#128508;"
				},
				{
					"title": "Статуя Свободы",
					"value": "&#128509;"
				},
				{
					"title": "Церковь",
					"value": "&#9962;"
				},
				{
					"title": "Мечеть",
					"value": "&#128332;"
				},
				{
					"title": "Синагога",
					"value": "&#128333;"
				},
				{
					"title": "Синтоистское святилище",
					"value": "&#9961;"
				},
				{
					"title": "Кааба",
					"value": "&#128331;"
				},
				{
					"title": "Фонтан",
					"value": "&#9970;"
				},
				{
					"title": "Палатка",
					"value": "&#9978;"
				},
				{
					"title": "Туманно",
					"value": "&#127745;"
				},
				{
					"title": "Ночь со звездами",
					"value": "&#127747;"
				},
				{
					"title": "Городской пейзаж",
					"value": "&#127961;"
				},
				{
					"title": "Восход солнца над горами",
					"value": "&#127748;"
				},
				{
					"title": "Восход солнца над водой",
					"value": "&#127749;"
				},
				{
					"title": "Городской пейзаж в сумерках",
					"value": "&#127750;"
				},
				{
					"title": "Закат над зданиями",
					"value": "&#127751;"
				},
				{
					"title": "Мост ночью",
					"value": "&#127753;"
				},
				{
					"title": "Горячие источники",
					"value": "&#9832;"
				},
				{
					"title": "Млечный Путь",
					"value": "&#127756;"
				},
				{
					"title": "Карусельная Лошадь",
					"value": "&#127904;"
				},
				{
					"title": "Колесо обозрения",
					"value": "&#127905;"
				},
				{
					"title": "Roller Coaster",
					"value": "&#127906;"
				},
				{
					"title": "Парикмахерская",
					"value": "&#128136;"
				},
				{
					"title": "Цирковой шатер",
					"value": "&#127914;"
				},
				{
					"title": "Паровоз",
					"value": "&#128642;"
				},
				{
					"title": "Железнодорожный вагон",
					"value": "&#128643;"
				},
				{
					"title": "Скоростной поезд",
					"value": "&#128644;"
				},
				{
					"title": "Скоростной поезд с пулевидным носом",
					"value": "&#128645;"
				},
				{
					"title": "Железная дорога",
					"value": "&#128646;"
				},
				{
					"title": "Метро",
					"value": "&#128647;"
				},
				{
					"title": "Скоростной трамвай",
					"value": "&#128648;"
				},
				{
					"title": "Станция",
					"value": "&#128649;"
				},
				{
					"title": "Трамвай",
					"value": "&#128650;"
				},
				{
					"title": "Монорельс",
					"value": "&#128669;"
				},
				{
					"title": "Горная железная дорога",
					"value": "&#128670;"
				},
				{
					"title": "Трамвайный вагон",
					"value": "&#128651;"
				},
				{
					"title": "Автобус",
					"value": "&#128652;"
				},
				{
					"title": "Приближающийся автобус",
					"value": "&#128653;"
				},
				{
					"title": "Троллейбус",
					"value": "&#128654;"
				},
				{
					"title": "Микроавтобус",
					"value": "&#128656;"
				},
				{
					"title": "Скорая помощь",
					"value": "&#128657;"
				},
				{
					"title": "Пожарная машина",
					"value": "&#128658;"
				},
				{
					"title": "Полицейская машина",
					"value": "&#128659;"
				},
				{
					"title": "Приближающаяся полицейская машина",
					"value": "&#128660;"
				},
				{
					"title": "Такси",
					"value": "&#128661;"
				},
				{
					"title": "Приближающееся такси",
					"value": "&#128662;"
				},
				{
					"title": "Автомобиль",
					"value": "&#128663;"
				},
				{
					"title": "Приближающийся автомобиль",
					"value": "&#128664;"
				},
				{
					"title": "Автомобиль для отдыха",
					"value": "&#128665;"
				},
				{
					"title": "Грузовик для доставки",
					"value": "&#128666;"
				},
				{
					"title": "Сочлененный грузовик",
					"value": "&#128667;"
				},
				{
					"title": "Трактор",
					"value": "&#128668;"
				},
				{
					"title": "Гоночный автомобиль",
					"value": "&#127950;"
				},
				{
					"title": "Гоночный мотоцикл",
					"value": "&#127949;"
				},
				{
					"title": "Мотороллер",
					"value": "&#128757;"
				},
				{
					"title": "Велосипед",
					"value": "&#128690;"
				},
				{
					"title": "Самокат",
					"value": "&#128756;"
				},
				{
					"title": "Скейтборд",
					"value": "&#128761;"
				},
				{
					"title": "Автобусная остановка",
					"value": "&#128655;"
				},
				{
					"title": "Автомагистраль",
					"value": "&#128739;"
				},
				{
					"title": "Железнодорожный путь",
					"value": "&#128740;"
				},
				{
					"title": "Бочка для масла",
					"value": "&#128738;"
				},
				{
					"title": "Заправка",
					"value": "&#9981;"
				},
				{
					"title": "Маячёк Полицейской машины",
					"value": "&#128680;"
				},
				{
					"title": "Горизонтальный светофор",
					"value": "&#128677;"
				},
				{
					"title": "Вертикальный светофор",
					"value": "&#128678;"
				},
				{
					"title": "Восьмиугольный знак",
					"value": "&#128721;"
				},
				{
					"title": "Строительный знак",
					"value": "&#128679;"
				},
				{
					"title": "Якорь",
					"value": "&#9875;"
				},
				{
					"title": "Парусник",
					"value": "&#9973;"
				},
				{
					"title": "Каноя",
					"value": "&#128758;"
				},
				{
					"title": "Быстроходный катер",
					"value": "&#128676;"
				},
				{
					"title": "Пассажирское судно",
					"value": "&#128755;"
				},
				{
					"title": "Паром",
					"value": "&#9972;"
				},
				{
					"title": "Моторная лодка",
					"value": "&#128741;"
				},
				{
					"title": "Корабль",
					"value": "&#128674;"
				},
				{
					"title": "Самолет",
					"value": "&#9992;"
				},
				{
					"title": "Маленький самолет",
					"value": "&#128745;"
				},
				{
					"title": "Вылет самолета",
					"value": "&#128747;"
				},
				{
					"title": "Прибытие самолета",
					"value": "&#128748;"
				},
				{
					"title": "Сиденье",
					"value": "&#128186;"
				},
				{
					"title": "Вертолет",
					"value": "&#128641;"
				},
				{
					"title": "Подвесная железная дорога",
					"value": "&#128671;"
				},
				{
					"title": "Горная канатная дорога",
					"value": "&#128672;"
				},
				{
					"title": "Канатная дорога",
					"value": "&#128673;"
				},
				{
					"title": "Спутник",
					"value": "&#128752;"
				},
				{
					"title": "Ракета",
					"value": "&#128640;"
				},
				{
					"title": "Летающая тарелка",
					"value": "&#128760;"
				},
				{
					"title": "Звонок",
					"value": "&#128718;"
				},
				{
					"title": "Багаж",
					"value": "&#129523;"
				},
				{
					"title": "Песочные часы",
					"value": "&#8987;"
				},
				{
					"title": "Песочные часы с сыпучим песком",
					"value": "&#9203;"
				},
				{
					"title": "Наручные часы",
					"value": "&#8986;"
				},
				{
					"title": "Будильник",
					"value": "&#9200;"
				},
				{
					"title": "Секундомер",
					"value": "&#9201;"
				},
				{
					"title": "Таймер",
					"value": "&#9202;"
				},
				{
					"title": "Часы на каминной полке",
					"value": "&#128368;"
				},
				{
					"title": "Циферблат Двенадцать часов",
					"value": "&#128347;"
				},
				{
					"title": "Циферблат Половина первого",
					"value": "&#128359;"
				},
				{
					"title": "Циферблат Один чс",
					"value": "&#128336;"
				},
				{
					"title": "Циферблат Половина второго",
					"value": "&#128348;"
				},
				{
					"title": "Циферблат Два часа",
					"value": "&#128337;"
				},
				{
					"title": "Циферблат Половина третьего",
					"value": "&#128349;"
				},
				{
					"title": "Циферблат Три часа",
					"value": "&#128338;"
				},
				{
					"title": "Циферблат Половина четвёртого",
					"value": "&#128350;"
				},
				{
					"title": "Циферблат Четыре часа",
					"value": "&#128339;"
				},
				{
					"title": "Циферблат Половина пятого",
					"value": "&#128351;"
				},
				{
					"title": "Циферблат Пять часов",
					"value": "&#128340;"
				},
				{
					"title": "Циферблат Половина шестого",
					"value": "&#128352;"
				},
				{
					"title": "Циферблат Шесть часов",
					"value": "&#128341;"
				},
				{
					"title": "Циферблат Половина седьмого",
					"value": "&#128353;"
				},
				{
					"title": "Циферблат Семь часов",
					"value": "&#128342;"
				},
				{
					"title": "Циферблат Половина восьмого",
					"value": "&#128354;"
				},
				{
					"title": "Циферблат Восемь Часов",
					"value": "&#128343;"
				},
				{
					"title": "Циферблат Половина девятого",
					"value": "&#128355;"
				},
				{
					"title": "Циферблат Девять часов",
					"value": "&#128344;"
				},
				{
					"title": "Циферблат Половина десятого",
					"value": "&#128356;"
				},
				{
					"title": "Циферблат Десять часов",
					"value": "&#128345;"
				},
				{
					"title": "Циферблат Половина одиннадцатого",
					"value": "&#128357;"
				},
				{
					"title": "Циферблат Одиннадцать часов",
					"value": "&#128346;"
				},
				{
					"title": "Циферблат Половина двеннадцатого",
					"value": "&#128358;"
				},
				{
					"title": "Символ новолуния",
					"value": "&#127761;"
				},
				{
					"title": "Символ растущей полумесяца",
					"value": "&#127762;"
				},
				{
					"title": "Символ первой четверти Луны",
					"value": "&#127763;"
				},
				{
					"title": "Символ растущей Луны",
					"value": "&#127764;"
				},
				{
					"title": "Символ Полной Луны",
					"value": "&#127765;"
				},
				{
					"title": "Символ убывающей Луны",
					"value": "&#127766;"
				},
				{
					"title": "Символ последней четверти Луны",
					"value": "&#127767;"
				},
				{
					"title": "Символ убывающей полумесяца",
					"value": "&#127768;"
				},
				{
					"title": "Полумесяц",
					"value": "&#127769;"
				},
				{
					"title": "Новолуние с лицом",
					"value": "&#127770;"
				},
				{
					"title": "Первая четверть Луны с лицом",
					"value": "&#127771;"
				},
				{
					"title": "Последняя четверть Луны с лицом",
					"value": "&#127772;"
				},
				{
					"title": "Термометр",
					"value": "&#127777;"
				},
				{
					"title": "Солнце С Лучами",
					"value": "&#9728;"
				},
				{
					"title": "Полная Луна С Лицом",
					"value": "&#127773;"
				},
				{
					"title": "Солнце с лицом",
					"value": "&#127774;"
				},
				{
					"title": "Белая средняя звезда",
					"value": "&#11088;"
				},
				{
					"title": "Светящаяся Звезда",
					"value": "&#127775;"
				},
				{
					"title": "Падающая звезда",
					"value": "&#127776;"
				},
				{
					"title": "Облако",
					"value": "&#9729;"
				},
				{
					"title": "Солнце за облаком",
					"value": "&#9925;"
				},
				{
					"title": "Грозовая туча и дождь",
					"value": "&#9928;"
				},
				{
					"title": "Белое Солнце с Маленьким Облаком",
					"value": "&#127780;"
				},
				{
					"title": "Белое Солнце За Облаком",
					"value": "&#127781;"
				},
				{
					"title": "Белое солнце за облаком с дождем",
					"value": "&#127782;"
				},
				{
					"title": "Облако с дождем",
					"value": "&#127783;"
				},
				{
					"title": "Облако со снегом",
					"value": "&#127784;"
				},
				{
					"title": "Облако с молнией",
					"value": "&#127785;"
				},
				{
					"title": "Облако с торнадо",
					"value": "&#127786;"
				},
				{
					"title": "Туман",
					"value": "&#127787;"
				},
				{
					"title": "Лицо, обдуваемое ветром",
					"value": "&#127788;"
				},
				{
					"title": "Циклон",
					"value": "&#127744;"
				},
				{
					"title": "Радуга",
					"value": "&#127752;"
				},
				{
					"title": "Закрытый зонт",
					"value": "&#127746;"
				},
				{
					"title": "Зонтик",
					"value": "&#9730;"
				},
				{
					"title": "Зонт с каплями дождя",
					"value": "&#9748;"
				},
				{
					"title": "Зонт на земле",
					"value": "&#9969;"
				},
				{
					"title": "Знак высокого напряжения",
					"value": "&#9889;"
				},
				{
					"title": "Снежинка",
					"value": "&#10052;"
				},
				{
					"title": "Снеговик",
					"value": "&#9731;"
				},
				{
					"title": "Снеговик без снега",
					"value": "&#9924;"
				},
				{
					"title": "Комета",
					"value": "&#9732;"
				},
				{
					"title": "Огонь",
					"value": "&#128293;"
				},
				{
					"title": "Капля",
					"value": "&#128167;"
				},
				{
					"title": "Водяная волна",
					"value": "&#127754;"
				}
			]
		},
		{
			"title": "Мероприятия и праздники",
			"id": "activy",
			"icons": [
				{
					"title": "Джек-фонарь",
					"value": "&#127875;"
				},
				{
					"title": "Новогодняя ёлка",
					"value": "&#127876;"
				},
				{
					"title": "Феерверк",
					"value": "&#127878;"
				},
				{
					"title": "Бенгальский огонь",
					"value": "&#127879;"
				},
				{
					"title": "Петарда",
					"value": "&#129512;"
				},
				{
					"title": "Искры",
					"value": "&#10024;"
				},
				{
					"title": "Воздушный шар",
					"value": "&#127880;"
				},
				{
					"title": "Хлопушка для вечеринок",
					"value": "&#127881;"
				},
				{
					"title": "Шар конфетти",
					"value": "&#127882;"
				},
				{
					"title": "Дерево Танабата",
					"value": "&#127883;"
				},
				{
					"title": "Сосновые украшения",
					"value": "&#127885;"
				},
				{
					"title": "Японские куклы",
					"value": "&#127886;"
				},
				{
					"title": "Карповый стример",
					"value": "&#127887;"
				},
				{
					"title": "Музыка Ветра",
					"value": "&#127888;"
				},
				{
					"title": "Церемония любования луной",
					"value": "&#127889;"
				},
				{
					"title": "Красный подарочный конверт",
					"value": "&#129511;"
				},
				{
					"title": "Лента",
					"value": "&#127872;"
				},
				{
					"title": "Упакованный подарок",
					"value": "&#127873;"
				},
				{
					"title": "Лента напоминаний",
					"value": "&#127895;"
				},
				{
					"title": "Входные билеты",
					"value": "&#127903;"
				},
				{
					"title": "Билет",
					"value": "&#127915;"
				},
				{
					"title": "Военная медаль",
					"value": "&#127894;"
				},
				{
					"title": "Кубок",
					"value": "&#127942;"
				},
				{
					"title": "Спортивная медаль",
					"value": "&#127941;"
				},
				{
					"title": "Медаль за первое место",
					"value": "&#129351;"
				},
				{
					"title": "Медаль за второе место",
					"value": "&#129352;"
				},
				{
					"title": "Медаль за третье место",
					"value": "&#129353;"
				},
				{
					"title": "Футбольный Мяч",
					"value": "&#9917;"
				},
				{
					"title": "Бейсбольный мяч",
					"value": "&#9918;"
				},
				{
					"title": "Софтбольный мяч",
					"value": "&#129358;"
				},
				{
					"title": "Баскетбольный мяч",
					"value": "&#127936;"
				},
				{
					"title": "Волейбольный мяч",
					"value": "&#127952;"
				},
				{
					"title": "Мяч для Американского футбола",
					"value": "&#127944;"
				},
				{
					"title": "Мяч для Регби",
					"value": "&#127945;"
				},
				{
					"title": "Тенисная ракетка и мяч",
					"value": "&#127934;"
				},
				{
					"title": "Летающий Диск",
					"value": "&#129359;"
				},
				{
					"title": "Боулинг",
					"value": "&#127923;"
				},
				{
					"title": "Бита и мяч для крикета",
					"value": "&#127951;"
				},
				{
					"title": "Клюшка и мяч для хоккея на траве",
					"value": "&#127953;"
				},
				{
					"title": "Хоккейная клюшка и шайба",
					"value": "&#127954;"
				},
				{
					"title": "Клюшка и мяч для лакросса",
					"value": "&#129357;"
				},
				{
					"title": "Ракетка и мяч для настольного тенниса",
					"value": "&#127955;"
				},
				{
					"title": "Бадминтонная ракетка и волан",
					"value": "&#127992;"
				},
				{
					"title": "Боксерская перчатка",
					"value": "&#129354;"
				},
				{
					"title": "Униформа для боевых искусств",
					"value": "&#129355;"
				},
				{
					"title": "Хоккеные ворота",
					"value": "&#129349;"
				},
				{
					"title": "Флажёк в Гольфе",
					"value": "&#9971;"
				},
				{
					"title": "Коньки",
					"value": "&#9976;"
				},
				{
					"title": "Удочка и рыба",
					"value": "&#127907;"
				},
				{
					"title": "Футболка для бега",
					"value": "&#127933;"
				},
				{
					"title": "Лыжи и лыжные ботинки",
					"value": "&#127935;"
				},
				{
					"title": "Сани",
					"value": "&#128759;"
				},
				{
					"title": "Камень для керлинга",
					"value": "&#129356;"
				},
				{
					"title": "Прямое попадание",
					"value": "&#127919;"
				},
				{
					"title": "Бильярд",
					"value": "&#127921;"
				},
				{
					"title": "Хрустальный шар",
					"value": "&#128302;"
				},
				{
					"title": "Амулет Назара",
					"value": "&#129535;"
				},
				{
					"title": "Видеоигра",
					"value": "&#127918;"
				},
				{
					"title": "Джойстик",
					"value": "&#128377;"
				},
				{
					"title": "Игровой автомат",
					"value": "&#127920;"
				},
				{
					"title": "Игровой кубик",
					"value": "&#127922;"
				},
				{
					"title": "Кусочек пазла",
					"value": "&#129513;"
				},
				{
					"title": "Плюшевый мишка",
					"value": "&#129528;"
				},
				{
					"title": "Масть Пики",
					"value": "&#9824;"
				},
				{
					"title": "Масть Черви",
					"value": "&#9829;"
				},
				{
					"title": "Масть Буби",
					"value": "&#9830;"
				},
				{
					"title": "Масть Крести",
					"value": "&#9827;"
				},
				{
					"title": "Чёрная пешка",
					"value": "&#9823;"
				},
				{
					"title": "Игральная карта Джокер",
					"value": "&#127183;"
				},
				{
					"title": "Плитка маджонга Красный дракон",
					"value": "&#126980;"
				},
				{
					"title": "Цветочные игральные карты",
					"value": "&#127924;"
				},
				{
					"title": "Театральные маски",
					"value": "&#127917;"
				},
				{
					"title": "Картина в рамке",
					"value": "&#128444;"
				},
				{
					"title": "Палитра художника",
					"value": "&#127912;"
				},
				{
					"title": "Катушка Ниток",
					"value": "&#129525;"
				},
				{
					"title": "Клубок пряжи",
					"value": "&#129526;"
				}
			]
		},
		{
			"title": "Объекты и вещи",
			"id": "objects",
			"icons": [
				{
					"title": "Очки",
					"value": "&#128083;"
				},
				{
					"title": "Чёрные очки",
					"value": "&#128374;"
				},
				{
					"title": "Маска аквалангиста",
					"value": "&#129405;"
				},
				{
					"title": "Лабораторный (докторский) халат",
					"value": "&#129404;"
				},
				{
					"title": "Галстук",
					"value": "&#128084;"
				},
				{
					"title": "Футболка",
					"value": "&#128085;"
				},
				{
					"title": "Джинсы",
					"value": "&#128086;"
				},
				{
					"title": "Шарф",
					"value": "&#129507;"
				},
				{
					"title": "Перчатки",
					"value": "&#129508;"
				},
				{
					"title": "Пальто",
					"value": "&#129509;"
				},
				{
					"title": "Носки",
					"value": "&#129510;"
				},
				{
					"title": "Платье",
					"value": "&#128087;"
				},
				{
					"title": "Кимано",
					"value": "&#128088;"
				},
				{
					"title": "Бикини (купальник)",
					"value": "&#128089;"
				},
				{
					"title": "Женский халат",
					"value": "&#128090;"
				},
				{
					"title": "Кошелёк",
					"value": "&#128091;"
				},
				{
					"title": "Сумочка",
					"value": "&#128092;"
				},
				{
					"title": "Мешочек",
					"value": "&#128093;"
				},
				{
					"title": "Пакеты для покупок",
					"value": "&#128717;"
				},
				{
					"title": "Школтный рюкзак",
					"value": "&#127890;"
				},
				{
					"title": "Мужская обувь",
					"value": "&#128094;"
				},
				{
					"title": "Спортивная обувь",
					"value": "&#128095;"
				},
				{
					"title": "Походные ботинки",
					"value": "&#129406;"
				},
				{
					"title": "Женская обувь\nна плоской подошве",
					"value": "&#129407;"
				},
				{
					"title": "Туфли\nна высоком каблуке",
					"value": "&#128096;"
				},
				{
					"title": "Женские сандалии",
					"value": "&#128097;"
				},
				{
					"title": "Женские сапоги",
					"value": "&#128098;"
				},
				{
					"title": "Корона",
					"value": "&#128081;"
				},
				{
					"title": "Женская панама",
					"value": "&#128082;"
				},
				{
					"title": "Цилиндр (мужской)",
					"value": "&#127913;"
				},
				{
					"title": "Шапочка выпускника",
					"value": "&#127891;"
				},
				{
					"title": "Бейсболка",
					"value": "&#129506;"
				},
				{
					"title": "Шлем с белым крестом",
					"value": "&#9937;"
				},
				{
					"title": "Четки для молитвы",
					"value": "&#128255;"
				},
				{
					"title": "Помада (губнушка)",
					"value": "&#128132;"
				},
				{
					"title": "Кольцо",
					"value": "&#128141;"
				},
				{
					"title": "Драгоценный камень",
					"value": "&#128142;"
				},
				{
					"title": "Звук запрещён",
					"value": "&#128263;"
				},
				{
					"title": "Динамик выключен",
					"value": "&#128264;"
				},
				{
					"title": "Динамик на минимальной громкости",
					"value": "&#128265;"
				},
				{
					"title": "Динамик на максимальной громкости",
					"value": "&#128266;"
				},
				{
					"title": "Громкоговоритель для оповещения",
					"value": "&#128226;"
				},
				{
					"title": "Мегафон",
					"value": "&#128227;"
				},
				{
					"title": "Почтовый Рог",
					"value": "&#128239;"
				},
				{
					"title": "Колокол",
					"value": "&#128276;"
				},
				{
					"title": "Колокол запрещён",
					"value": "&#128277;"
				},
				{
					"title": "Музыкальная партитура",
					"value": "&#127932;"
				},
				{
					"title": "Музыкальная нота",
					"value": "&#127925;"
				},
				{
					"title": "Музыкальные ноты",
					"value": "&#127926;"
				},
				{
					"title": "Студийный микрофон",
					"value": "&#127897;"
				},
				{
					"title": "Регулятор слайдер",
					"value": "&#127898;"
				},
				{
					"title": "Ручки управления",
					"value": "&#127899;"
				},
				{
					"title": "Микрофон",
					"value": "&#127908;"
				},
				{
					"title": "Наушники",
					"value": "&#127911;"
				},
				{
					"title": "Радио",
					"value": "&#128251;"
				},
				{
					"title": "Саксафон",
					"value": "&#127927;"
				},
				{
					"title": "Гитара",
					"value": "&#127928;"
				},
				{
					"title": "Музыкальная клавиатура",
					"value": "&#127929;"
				},
				{
					"title": "Музыкальная Труба",
					"value": "&#127930;"
				},
				{
					"title": "Скрипка",
					"value": "&#127931;"
				},
				{
					"title": "Барабан с барабанными палочками",
					"value": "&#129345;"
				},
				{
					"title": "Мобильный телефон",
					"value": "&#128241;"
				},
				{
					"title": "Мобильный телефон приём звонка",
					"value": "&#128242;"
				},
				{
					"title": "Дисковый Телефон",
					"value": "&#9742;"
				},
				{
					"title": "Телефонная трубка",
					"value": "&#128222;"
				},
				{
					"title": "Пейджер",
					"value": "&#128223;"
				},
				{
					"title": "Факс",
					"value": "&#128224;"
				},
				{
					"title": "Батарейка",
					"value": "&#128267;"
				},
				{
					"title": "Электрическая вилка",
					"value": "&#128268;"
				},
				{
					"title": "Ноутбук",
					"value": "&#128187;"
				},
				{
					"title": "Компьютер",
					"value": "&#128421;"
				},
				{
					"title": "Принтер",
					"value": "&#128424;"
				},
				{
					"title": "Клавиатура",
					"value": "&#9000;"
				},
				{
					"title": "Трехкнопочная мышь",
					"value": "&#128433;"
				},
				{
					"title": "Трекбол",
					"value": "&#128434;"
				},
				{
					"title": "Минидиск",
					"value": "&#128189;"
				},
				{
					"title": "Дискета 3.5\" 1,44Мб",
					"value": "&#128190;"
				},
				{
					"title": "Оптический Диск CD",
					"value": "&#128191;"
				},
				{
					"title": "Оптический Диск DVD",
					"value": "&#128192;"
				},
				{
					"title": "Счеты",
					"value": "&#129518;"
				},
				{
					"title": "Кинокамера",
					"value": "&#127909;"
				},
				{
					"title": "Кинолента",
					"value": "&#127902;"
				},
				{
					"title": "Фильмоскоп (проектор)",
					"value": "&#128253;"
				},
				{
					"title": "Кинохлопушка",
					"value": "&#127916;"
				},
				{
					"title": "Телевизор",
					"value": "&#128250;"
				},
				{
					"title": "Фотокамера",
					"value": "&#128247;"
				},
				{
					"title": "Фотокамера с фотовспышкой",
					"value": "&#128248;"
				},
				{
					"title": "Видео камера",
					"value": "&#128249;"
				},
				{
					"title": "Видеокассета",
					"value": "&#128252;"
				},
				{
					"title": "Увелечительное стекло\nс ручеой слева",
					"value": "&#128269;"
				},
				{
					"title": "Увелечительное стекло\nс ручеой справа",
					"value": "&#128270;"
				},
				{
					"title": "Горящая Свеча",
					"value": "&#128367;"
				},
				{
					"title": "Электрическая лампочка",
					"value": "&#128161;"
				},
				{
					"title": "Электрический фонарик",
					"value": "&#128294;"
				},
				{
					"title": "Крассный фонарь",
					"value": "&#127982;"
				},
				{
					"title": "Блокнот с декоративной обложкой",
					"value": "&#128212;"
				},
				{
					"title": "Закрытая книга",
					"value": "&#128213;"
				},
				{
					"title": "Открытая книга",
					"value": "&#128214;"
				},
				{
					"title": "Зелёная Книга",
					"value": "&#128215;"
				},
				{
					"title": "Синяя книга",
					"value": "&#128216;"
				},
				{
					"title": "Оранжевая книга",
					"value": "&#128217;"
				},
				{
					"title": "Книги",
					"value": "&#128218;"
				},
				{
					"title": "Блокнот",
					"value": "&#128211;"
				},
				{
					"title": "Бухгалтерская книга",
					"value": "&#128210;"
				},
				{
					"title": "Страница с завитком",
					"value": "&#128195;"
				},
				{
					"title": "Страница с завитками сверху и снизу",
					"value": "&#128220;"
				},
				{
					"title": "Страница лицевой стороной вверх",
					"value": "&#128196;"
				},
				{
					"title": "Газета",
					"value": "&#128240;"
				},
				{
					"title": "Свернутая в трубочку газета",
					"value": "&#128478;"
				},
				{
					"title": "Закладки Вкладки",
					"value": "&#128209;"
				},
				{
					"title": "Закладка",
					"value": "&#128278;"
				},
				{
					"title": "Этикетка",
					"value": "&#127991;"
				},
				{
					"title": "Денежный мешок",
					"value": "&#128176;"
				},
				{
					"title": "Банкнота со знаком иены",
					"value": "&#128180;"
				},
				{
					"title": "Банкнота со знаком доллара",
					"value": "&#128181;"
				},
				{
					"title": "Банкнота со знаком евро",
					"value": "&#128182;"
				},
				{
					"title": "Банкнота со знаком фунта",
					"value": "&#128183;"
				},
				{
					"title": "Деньги с крыльями",
					"value": "&#128184;"
				},
				{
					"title": "Кредитная карта",
					"value": "&#128179;"
				},
				{
					"title": "Квитанция",
					"value": "&#129534;"
				},
				{
					"title": "График с восходящим трендом и знаком иены",
					"value": "&#128185;"
				},
				{
					"title": "Обмен валюты",
					"value": "&#128177;"
				},
				{
					"title": "Тяжелый знак доллара",
					"value": "&#128178;"
				},
				{
					"title": "Конверт",
					"value": "&#9993;"
				},
				{
					"title": "Символ электронной почты",
					"value": "&#128231;"
				},
				{
					"title": "Входящий конверт",
					"value": "&#128232;"
				},
				{
					"title": "Конверт со стрелкой вниз сверху",
					"value": "&#128233;"
				},
				{
					"title": "Лоток для исходящих писем",
					"value": "&#128228;"
				},
				{
					"title": "Лоток для входящих сообщений",
					"value": "&#128229;"
				},
				{
					"title": "Упаковка",
					"value": "&#128230;"
				},
				{
					"title": "Закрытый почтовый ящик с поднятым флагом",
					"value": "&#128235;"
				},
				{
					"title": "Закрытый почтовый ящик с опущенным флагом",
					"value": "&#128234;"
				},
				{
					"title": "Открытый почтовый ящик с поднятым флагом",
					"value": "&#128236;"
				},
				{
					"title": "Открытый почтовый ящик с опущенным флагом",
					"value": "&#128237;"
				},
				{
					"title": "Почтовый ящик",
					"value": "&#128238;"
				},
				{
					"title": "Урна для голосования с бюллетенем",
					"value": "&#128499;"
				},
				{
					"title": "Карандаш",
					"value": "&#9999;"
				},
				{
					"title": "Перьевая ручка",
					"value": "&#10002;"
				},
				{
					"title": "Нижняя левая перьевая ручка",
					"value": "&#128395;"
				},
				{
					"title": "Нижняя левая шариковая ручка",
					"value": "&#128394;"
				},
				{
					"title": "Нижняя левая кисть",
					"value": "&#128396;"
				},
				{
					"title": "Нижний левый карандаш",
					"value": "&#128397;"
				},
				{
					"title": "Памятка",
					"value": "&#128221;"
				},
				{
					"title": "Портфель",
					"value": "&#128188;"
				},
				{
					"title": "Папка с файлами",
					"value": "&#128193;"
				},
				{
					"title": "Открытая Папка с файлами",
					"value": "&#128194;"
				},
				{
					"title": "Разделители для картотеки",
					"value": "&#128450;"
				},
				{
					"title": "Календарь",
					"value": "&#128197;"
				},
				{
					"title": "Отрывной календарь",
					"value": "&#128198;"
				},
				{
					"title": "Блокнот со спиралью",
					"value": "&#128466;"
				},
				{
					"title": "Блокнот-календарь со спиралью",
					"value": "&#128467;"
				},
				{
					"title": "Картотека",
					"value": "&#128199;"
				},
				{
					"title": "График с восходящим трендом",
					"value": "&#128200;"
				},
				{
					"title": "График с нисходящим трендом",
					"value": "&#128201;"
				},
				{
					"title": "Столбчатая диаграмма",
					"value": "&#128202;"
				},
				{
					"title": "Буфер обмена",
					"value": "&#128203;"
				},
				{
					"title": "Кнопка",
					"value": "&#128204;"
				},
				{
					"title": "Круглая кнопка",
					"value": "&#128205;"
				},
				{
					"title": "Скрепка для бумаг",
					"value": "&#128206;"
				},
				{
					"title": "Связанные скрепки",
					"value": "&#128391;"
				},
				{
					"title": "Линейка",
					"value": "&#128207;"
				},
				{
					"title": "Треугольная линейка",
					"value": "&#128208;"
				},
				{
					"title": "Ножницы",
					"value": "&#9986;"
				},
				{
					"title": "Коробка для картотеки",
					"value": "&#128451;"
				},
				{
					"title": "Файловый шкаф",
					"value": "&#128452;"
				},
				{
					"title": "Мусорная корзина",
					"value": "&#128465;"
				},
				{
					"title": "Замок",
					"value": "&#128274;"
				},
				{
					"title": "Открытый замок",
					"value": "&#128275;"
				},
				{
					"title": "Замок с чернильной ручкой",
					"value": "&#128271;"
				},
				{
					"title": "Закрытый замок с ключом",
					"value": "&#128272;"
				},
				{
					"title": "Ключ",
					"value": "&#128273;"
				},
				{
					"title": "Старый ключ",
					"value": "&#128477;"
				},
				{
					"title": "Молоток",
					"value": "&#128296;"
				},
				{
					"title": "Кирка",
					"value": "&#9935;"
				},
				{
					"title": "Молоток и кирка",
					"value": "&#9874;"
				},
				{
					"title": "Молоток и гаечный ключ",
					"value": "&#128736;"
				},
				{
					"title": "Кинжал-нож",
					"value": "&#128481;"
				},
				{
					"title": "Скрещенные мечи",
					"value": "&#9876;"
				},
				{
					"title": "Пистолет",
					"value": "&#128299;"
				},
				{
					"title": "Лук и стрелы",
					"value": "&#127993;"
				},
				{
					"title": "Щит",
					"value": "&#128737;"
				},
				{
					"title": "Гаечный ключ",
					"value": "&#128295;"
				},
				{
					"title": "Болт с кайкой",
					"value": "&#128297;"
				},
				{
					"title": "Механизм",
					"value": "&#9881;"
				},
				{
					"title": "Сжатие",
					"value": "&#128476;"
				},
				{
					"title": "Весы",
					"value": "&#9878;"
				},
				{
					"title": "Символ ссылки",
					"value": "&#128279;"
				},
				{
					"title": "Цепи",
					"value": "&#9939;"
				},
				{
					"title": "Ящик для инструментов",
					"value": "&#129520;"
				},
				{
					"title": "Магнит",
					"value": "&#129522;"
				},
				{
					"title": "Перегонный куб",
					"value": "&#9879;"
				},
				{
					"title": "Пробирка",
					"value": "&#129514;"
				},
				{
					"title": "Чашка Петри",
					"value": "&#129515;"
				},
				{
					"title": "Двойная спираль ДНК",
					"value": "&#129516;"
				},
				{
					"title": "Микроскоп",
					"value": "&#128300;"
				},
				{
					"title": "Телескоп",
					"value": "&#128301;"
				},
				{
					"title": "Спутниковая антенна",
					"value": "&#128225;"
				},
				{
					"title": "Шприц",
					"value": "&#128137;"
				},
				{
					"title": "Пилюля",
					"value": "&#128138;"
				},
				{
					"title": "Дверь",
					"value": "&#128682;"
				},
				{
					"title": "Кровать",
					"value": "&#128719;"
				},
				{
					"title": "Диван и лампа",
					"value": "&#128715;"
				},
				{
					"title": "",
					"value": "&#128701;"
				},
				{
					"title": "Унитаз",
					"value": "&#128703;"
				},
				{
					"title": "Ванна",
					"value": "&#128705;"
				},
				{
					"title": "Флакон лосьона",
					"value": "&#129524;"
				},
				{
					"title": "Английская булавка",
					"value": "&#129527;"
				},
				{
					"title": "Метла",
					"value": "&#129529;"
				},
				{
					"title": "Корзина",
					"value": "&#129530;"
				},
				{
					"title": "Рулон бумаги",
					"value": "&#129531;"
				},
				{
					"title": "Кусок мыла",
					"value": "&#129532;"
				},
				{
					"title": "Губка",
					"value": "&#129533;"
				},
				{
					"title": "Огнетушитель",
					"value": "&#129519;"
				},
				{
					"title": "Тележка для покупок",
					"value": "&#128722;"
				},
				{
					"title": "Символ курения",
					"value": "&#128684;"
				},
				{
					"title": "Гроб",
					"value": "&#9904;"
				},
				{
					"title": "Погребальная урна",
					"value": "&#9905;"
				},
				{
					"title": "Мояи",
					"value": "&#128511;"
				}
			]
		},
		{
			"title": "Символы",
			"id": "symbols",
			"icons": [
				{
					"title": "Банкомат",
					"value": "&#127975;"
				},
				{
					"title": "Уберите мусор",
					"value": "&#128686;"
				},
				{
					"title": "Питьевая вода",
					"value": "&#128688;"
				},
				{
					"title": "Инвалидная коляска",
					"value": "&#9855;"
				},
				{
					"title": "Символ: Мужчина",
					"value": "&#128697;"
				},
				{
					"title": "Символ: Женщина",
					"value": "&#128698;"
				},
				{
					"title": "Туалет",
					"value": "&#128699;"
				},
				{
					"title": "Символ: Ребёнок",
					"value": "&#128700;"
				},
				{
					"title": "Уборная",
					"value": "&#128702;"
				},
				{
					"title": "Паспортный контроль",
					"value": "&#128706;"
				},
				{
					"title": "Таможня",
					"value": "&#128707;"
				},
				{
					"title": "Выдача багажа",
					"value": "&#128708;"
				},
				{
					"title": "Камера хранения багажа",
					"value": "&#128709;"
				},
				{
					"title": "Предупреждающий знак",
					"value": "&#9888;"
				},
				{
					"title": "Детский переход",
					"value": "&#128696;"
				},
				{
					"title": "Запрещающий знак",
					"value": "&#9940;"
				},
				{
					"title": "Знак «Вход воспрещен»",
					"value": "&#128683;"
				},
				{
					"title": "Велосипеды запрещены",
					"value": "&#128691;"
				},
				{
					"title": "Курить запрещено",
					"value": "&#128685;"
				},
				{
					"title": "Не мусорить",
					"value": "&#128687;"
				},
				{
					"title": "Непитьевая вода",
					"value": "&#128689;"
				},
				{
					"title": "Движение пешеходов запрещено",
					"value": "&#128695;"
				},
				{
					"title": "Никаких мобильных телефонов",
					"value": "&#128245;"
				},
				{
					"title": "Запрещено Младше восемнадцати",
					"value": "&#128286;"
				},
				{
					"title": "Радиационная опастность",
					"value": "&#9762;"
				},
				{
					"title": "Биологичевкая опастность",
					"value": "&#9763;"
				},
				{
					"title": "Черная Стрелка Вверх",
					"value": "&#11014;"
				},
				{
					"title": "Северо-Восточная Стрелка",
					"value": "&#8599;"
				},
				{
					"title": "Черная стрелка вправо",
					"value": "&#10145;"
				},
				{
					"title": "Юго-Восточная Стрелка",
					"value": "&#8600;"
				},
				{
					"title": "Черная стрелка вниз",
					"value": "&#11015;"
				},
				{
					"title": "Юго-Западная Стрелка",
					"value": "&#8601;"
				},
				{
					"title": "Черная стрелка влево",
					"value": "&#11013;"
				},
				{
					"title": "Северо-Западная Стрелка",
					"value": "&#8598;"
				},
				{
					"title": "Стрелка вверх-вниз",
					"value": "&#8597;"
				},
				{
					"title": "Стрелка влево-вправо",
					"value": "&#8596;"
				},
				{
					"title": "Стрелка влево с крючком",
					"value": "&#8617;"
				},
				{
					"title": "Стрелка вправо с крючком",
					"value": "&#8618;"
				},
				{
					"title": "Стрелка, направленная вправо,\nзатем изгибающаяся вверх",
					"value": "&#10548;"
				},
				{
					"title": "Стрелка, направленная вправо,\nзатем изгибающаяся вниз",
					"value": "&#10549;"
				},
				{
					"title": "Открытые круговые стрелки,\nнаправленные вверх и вниз\nпо часовой стрелке",
					"value": "&#128259;"
				},
				{
					"title": "Открытые круговые стрелки,\nнаправленные вверх и вниз\nпротив часовой стрелке",
					"value": "&#128260;"
				},
				{
					"title": "Назад со стрелкой влево сверху",
					"value": "&#128281;"
				},
				{
					"title": "Завершить со стрелкой влево сверху",
					"value": "&#128282;"
				},
				{
					"title": "С восклицательным знаком\nи стрелкой влево-вправо сверху",
					"value": "&#128283;"
				},
				{
					"title": "Скоро\nсо стрелкой вправо вверху",
					"value": "&#128284;"
				},
				{
					"title": "Вверх\nсо стрелкой вверх вверху",
					"value": "&#128285;"
				},
				{
					"title": "Место поклонения",
					"value": "&#128720;"
				},
				{
					"title": "Символ Атома",
					"value": "&#9883;"
				},
				{
					"title": "Символ Ом",
					"value": "&#128329;"
				},
				{
					"title": "Звезда Давида",
					"value": "&#10017;"
				},
				{
					"title": "Колесо Дхармы",
					"value": "&#9784;"
				},
				{
					"title": "Инь Ян",
					"value": "&#9775;"
				},
				{
					"title": "Латинский крест",
					"value": "&#10013;"
				},
				{
					"title": "Православный крест",
					"value": "&#9766;"
				},
				{
					"title": "Звезда и полумесяц",
					"value": "&#9770;"
				},
				{
					"title": "Символ мира",
					"value": "&#9774;"
				},
				{
					"title": "Менора с девятью ветвями",
					"value": "&#128334;"
				},
				{
					"title": "Шестиконечная звезда с точкой посередине",
					"value": "&#128303;"
				},
				{
					"title": "Овен",
					"value": "&#9800;"
				},
				{
					"title": "Телец",
					"value": "&#9801;"
				},
				{
					"title": "Близнецы",
					"value": "&#9802;"
				},
				{
					"title": "Рак",
					"value": "&#9803;"
				},
				{
					"title": "Лев",
					"value": "&#9804;"
				},
				{
					"title": "Дева",
					"value": "&#9805;"
				},
				{
					"title": "Весы",
					"value": "&#9806;"
				},
				{
					"title": "Скорпион",
					"value": "&#9807;"
				},
				{
					"title": "Стрелец",
					"value": "&#9808;"
				},
				{
					"title": "Козерог",
					"value": "&#9809;"
				},
				{
					"title": "Водолей",
					"value": "&#9810;"
				},
				{
					"title": "Рыбы",
					"value": "&#9811;"
				},
				{
					"title": "Змееносец",
					"value": "&#9934;"
				},
				{
					"title": "Скрученные стрелки,\nнаправленные вправо",
					"value": "&#128256;"
				},
				{
					"title": "Круглые стрелки,\nнаправленные вправо и влево по часовой стрелке",
					"value": "&#128257;"
				},
				{
					"title": "Круглые стрелки,\nнаправленные по часовой стрелке вправо и влево,\nс наложением еденицы в кружке",
					"value": "&#128258;"
				},
				{
					"title": "Треугольник,\nнаправленный вправо",
					"value": "&#9654;"
				},
				{
					"title": "Двойной треугольник,\nнаправленный вправо",
					"value": "&#9193;"
				},
				{
					"title": "Двойной треугольник,\nнаправленный вправо,\nс вертикальной чертой",
					"value": "&#9197;"
				},
				{
					"title": "Треугольник,\nнаправленный вправо,\nс двойной вертикальной чертой",
					"value": "&#9199;"
				},
				{
					"title": "Треугольник,\nнаправленный влево",
					"value": "&#9664;"
				},
				{
					"title": "Двойной треугольник,\nнаправленный влево",
					"value": "&#9194;"
				},
				{
					"title": "Двойной треугольник,\nнаправленный влево,\nс вертикальной чертой",
					"value": "&#9198;"
				},
				{
					"title": "Треугольник вершиной вверх",
					"value": "&#128316;"
				},
				{
					"title": "Двойной треугольник вершиной вверх",
					"value": "&#9195;"
				},
				{
					"title": "Треугольник вершиной вниз",
					"value": "&#128317;"
				},
				{
					"title": "Двойной треугольник вершиной вниз",
					"value": "&#9196;"
				},
				{
					"title": "Двойная вертикальная полоса",
					"value": "&#9208;"
				},
				{
					"title": "Квадрат остановки",
					"value": "&#9209;"
				},
				{
					"title": "Круг записи",
					"value": "&#9210;"
				},
				{
					"title": "Символ извлечения",
					"value": "&#9167;"
				},
				{
					"title": "Кино",
					"value": "&#127910;"
				},
				{
					"title": "Символ низкой яркости",
					"value": "&#128261;"
				},
				{
					"title": "Символ высокой яркости",
					"value": "&#128262;"
				},
				{
					"title": "Антенна с решеткой",
					"value": "&#128246;"
				},
				{
					"title": "Режим вибрации",
					"value": "&#128243;"
				},
				{
					"title": "Мобильный телефон выключен",
					"value": "&#128244;"
				},
				{
					"title": "Женский знак",
					"value": "&#9792;"
				},
				{
					"title": "Мужской знак",
					"value": "&#9794;"
				},
				{
					"title": "Посох Эскулапа",
					"value": "&#9877;"
				},
				{
					"title": "Постоянный бумажный знак",
					"value": "&#9854;"
				},
				{
					"title": "Символ переработки",
					"value": "&#9851;"
				},
				{
					"title": "Цветок лилии",
					"value": "&#9884;"
				},
				{
					"title": "Эмблема трезубца",
					"value": "&#128305;"
				},
				{
					"title": "Бейдж с именем",
					"value": "&#128219;"
				},
				{
					"title": "Японский символ для начинающих",
					"value": "&#128304;"
				},
				{
					"title": "Тяжелый большой круг",
					"value": "&#11093;"
				},
				{
					"title": "Белая жирная галочка",
					"value": "&#9989;"
				},
				{
					"title": "Урна для голосования с проверкой",
					"value": "&#9745;"
				},
				{
					"title": "Тяжелая галочка",
					"value": "&#10004;"
				},
				{
					"title": "Тяжелое умножение X",
					"value": "&#10006;"
				},
				{
					"title": "Крест Марк",
					"value": "&#10060;"
				},
				{
					"title": "Отрицательный квадратный крестик",
					"value": "&#10062;"
				},
				{
					"title": "Тяжелый знак плюса",
					"value": "&#10133;"
				},
				{
					"title": "Тяжелый знак минус",
					"value": "&#10134;"
				},
				{
					"title": "Знак тяжелого деления",
					"value": "&#10135;"
				},
				{
					"title": "Вьющаяся петля",
					"value": "&#10160;"
				},
				{
					"title": "Двойная вьющаяся петля",
					"value": "&#10175;"
				},
				{
					"title": "Знак чередования частей",
					"value": "&#12349;"
				},
				{
					"title": "Восьмиконечная звездочка",
					"value": "&#10035;"
				},
				{
					"title": "Восьмиконечная черная звезда",
					"value": "&#10036;"
				},
				{
					"title": "Искра",
					"value": "&#10055;"
				},
				{
					"title": "Двойной восклицательный знак",
					"value": "&#8252;"
				},
				{
					"title": "Восклицательный знак вопроса",
					"value": "&#8265;"
				},
				{
					"title": "Черный вопросительный знак",
					"value": "&#10067;"
				},
				{
					"title": "Белый вопросительный знак",
					"value": "&#10068;"
				},
				{
					"title": "Белый восклицательный знак",
					"value": "&#10069;"
				},
				{
					"title": "Символ жирного восклицательного знака",
					"value": "&#10071;"
				},
				{
					"title": "Волнистая черта",
					"value": "&#12336;"
				},
				{
					"title": "Знак авторского права",
					"value": "&#169;"
				},
				{
					"title": "Зарегистрированный знак",
					"value": "&#174;"
				},
				{
					"title": "Товарный знак",
					"value": "&#8482;"
				},
				{
					"title": "Знак решётки",
					"value": "&#35;&#65039;&#8419;"
				},
				{
					"title": "Сноска",
					"value": "&#42;&#65039;&#8419;"
				},
				{
					"title": "Нулевой знак",
					"value": "&#48;&#65039;&#8419;"
				},
				{
					"title": "Знак еденица",
					"value": "&#49;&#65039;&#8419;"
				},
				{
					"title": "Знак двойка",
					"value": "&#50;&#65039;&#8419;"
				},
				{
					"title": "Знак тройка",
					"value": "&#51;&#65039;&#8419;"
				},
				{
					"title": "Знак четвёрка",
					"value": "&#52;&#65039;&#8419;"
				},
				{
					"title": "Знак пятёрка",
					"value": "&#53;&#65039;&#8419;"
				},
				{
					"title": "Знак шестёрка",
					"value": "&#54;&#65039;&#8419;"
				},
				{
					"title": "Знак семёрка",
					"value": "&#55;&#65039;&#8419;"
				},
				{
					"title": "Знак восьмёрка",
					"value": "&#56;&#65039;&#8419;"
				},
				{
					"title": "Знак девятка",
					"value": "&#57;&#65039;&#8419;"
				},
				{
					"title": "Знак десятка",
					"value": "&#128287;"
				},
				{
					"title": "Знак ABCD",
					"value": "&#128288;"
				},
				{
					"title": "Знак abcd",
					"value": "&#128289;"
				},
				{
					"title": "Знак 1234",
					"value": "&#128290;"
				},
				{
					"title": "Символ ввода символов",
					"value": "&#128291;"
				},
				{
					"title": "Символ ввода букв",
					"value": "&#128292;"
				},
				{
					"title": "Латинская заглавная буква A\nв отрицательном квадрате",
					"value": "&#127344;"
				},
				{
					"title": "Отрицательный квадрат Ab",
					"value": "&#127374;"
				},
				{
					"title": "Латинская заглавная буква B\nв отрицательном квадрате",
					"value": "&#127345;"
				},
				{
					"title": "Квадратный Cl",
					"value": "&#127377;"
				},
				{
					"title": "Квадратный Крутой",
					"value": "&#127378;"
				},
				{
					"title": "В квадрате бесплатно",
					"value": "&#127379;"
				},
				{
					"title": "Символ Информации",
					"value": "&#8505;"
				},
				{
					"title": "Квадратный ID",
					"value": "&#127380;"
				},
				{
					"title": "Латинская заглавная буква M\nв круге",
					"value": "&#9410;"
				},
				{
					"title": "Квадратный Новый",
					"value": "&#127381;"
				},
				{
					"title": "Квадратный NG",
					"value": "&#127382;"
				},
				{
					"title": "Отрицательная квадратная\nлатинская заглавная буква O",
					"value": "&#127358;"
				},
				{
					"title": "Квадратный OK",
					"value": "&#127383;"
				},
				{
					"title": "Отрицательная квадратная\nлатинская заглавная буква P",
					"value": "&#127359;"
				},
				{
					"title": "SOS в квадрате",
					"value": "&#127384;"
				},
				{
					"title": "В квадрате Вверх\nс восклицательным знаком",
					"value": "&#127385;"
				},
				{
					"title": "В квадрате VS",
					"value": "&#127386;"
				},
				{
					"title": "Квадратная катакана Коко",
					"value": "&#127489;"
				},
				{
					"title": "Квадратная катакана Sa",
					"value": "&#127490;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-6708",
					"value": "&#127543;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-6709",
					"value": "&#127542;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-6307",
					"value": "&#127535;"
				},
				{
					"title": "Преимущество идеограммы в круге",
					"value": "&#127568;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-5272",
					"value": "&#127545;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-7121",
					"value": "&#127514;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-7981",
					"value": "&#127538;"
				},
				{
					"title": "Круглая идеограмма Принять",
					"value": "&#127569;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-7533",
					"value": "&#127544;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-6408",
					"value": "&#127540;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-7A7A",
					"value": "&#127539;"
				},
				{
					"title": "Круглая идеограмма Поздравление",
					"value": "&#12951;"
				},
				{
					"title": "Круглая идеограмма Секрет",
					"value": "&#12953;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-55B6",
					"value": "&#127546;"
				},
				{
					"title": "Квадратный Cjk\nунифицированный идеограф-6E80",
					"value": "&#127541;"
				},
				{
					"title": "Большой красный круг",
					"value": "&#128308;"
				},
				{
					"title": "Большой синий круг",
					"value": "&#128309;"
				},
				{
					"title": "Средний белый круг",
					"value": "&#9898;"
				},
				{
					"title": "Средний черный круг",
					"value": "&#9899;"
				},
				{
					"title": "Белый большой квадрат",
					"value": "&#11036;"
				},
				{
					"title": "Черный большой квадрат",
					"value": "&#11035;"
				},
				{
					"title": "Черный средний квадрат",
					"value": "&#9724;"
				},
				{
					"title": "Белый средний квадрат",
					"value": "&#9723;"
				},
				{
					"title": "Белый Средний Маленький Квадрат",
					"value": "&#9725;"
				},
				{
					"title": "Черный Средний Маленький Квадрат",
					"value": "&#9726;"
				},
				{
					"title": "Белый маленький квадрат",
					"value": "&#9643;"
				},
				{
					"title": "Черный маленький квадрат",
					"value": "&#9642;"
				},
				{
					"title": "Большой оранжевый бриллиант",
					"value": "&#128310;"
				},
				{
					"title": "Большой голубой бриллиант",
					"value": "&#128311;"
				},
				{
					"title": "Маленький оранжевый бриллиант",
					"value": "&#128312;"
				},
				{
					"title": "Маленький голубой бриллиант",
					"value": "&#128313;"
				},
				{
					"title": "Красный треугольник вершиной вверх",
					"value": "&#128314;"
				},
				{
					"title": "Красный треугольник вершиной вниз",
					"value": "&#128315;"
				},
				{
					"title": "Форма ромба с точкой внутри",
					"value": "&#128160;"
				},
				{
					"title": "Радиокнопка",
					"value": "&#128280;"
				},
				{
					"title": "Черная квадратная кнопка",
					"value": "&#128306;"
				},
				{
					"title": "Белая квадратная кнопка",
					"value": "&#128307;"
				}
			]
		},
		{
			"title": "Флаги",
			"id": "flags",
			"icons": [
				{
					"title": "Клетчатый флаг",
					"value": "&#127937;"
				},
				{
					"title": "Треугольный флаг",
					"value": "&#128681;"
				},
				{
					"title": "Скрещенные флаги",
					"value": "&#127884;"
				},
				{
					"title": "Черный флаг",
					"value": "&#127988;"
				},
				{
					"title": "Белый флаг",
					"value": "&#127987;"
				},
				{
					"title": "Радужный флаг",
					"value": "&#127987;&#65039;&#8205;&#127752;"
				},
				{
					"title": "Флаг Трансгендерного Сообщества",
					"value": "&#127987;&#65039;&#8205;&#9895;&#65039;"
				},
				{
					"title": "Пиратский флаг",
					"value": "&#127988;&#8205;&#9760;&#65039;"
				},
				{
					"title": "Флаг: О-В Вознесения",
					"value": "&#127462;&#127464;"
				},
				{
					"title": "Флаг: Андорра",
					"value": "&#127462;&#127465;"
				},
				{
					"title": "Флаг: Оаэ",
					"value": "&#127462;&#127466;"
				},
				{
					"title": "Флаг: Афганистан",
					"value": "&#127462;&#127467;"
				},
				{
					"title": "Флаг: Антигуа и Барбуда",
					"value": "&#127462;&#127468;"
				},
				{
					"title": "Флаг: Ангилья",
					"value": "&#127462;&#127470;"
				},
				{
					"title": "Флаг: Албания",
					"value": "&#127462;&#127473;"
				},
				{
					"title": "Флаг: Армения",
					"value": "&#127462;&#127474;"
				},
				{
					"title": "Флаг: Ангола",
					"value": "&#127462;&#127476;"
				},
				{
					"title": "Флаг: Антарктида",
					"value": "&#127462;&#127478;"
				},
				{
					"title": "Флаг: Аргентина",
					"value": "&#127462;&#127479;"
				},
				{
					"title": "Флаг: Американское Самоа",
					"value": "&#127462;&#127480;"
				},
				{
					"title": "Флаг: Австрия",
					"value": "&#127462;&#127481;"
				},
				{
					"title": "Флаг: Австралия",
					"value": "&#127462;&#127482;"
				},
				{
					"title": "Флаг: Аруба",
					"value": "&#127462;&#127484;"
				},
				{
					"title": "Флаг: Аландские О-Ва",
					"value": "&#127462;&#127485;"
				},
				{
					"title": "Флаг: Азербайджан",
					"value": "&#127462;&#127487;"
				},
				{
					"title": "Флаг: Босния и Герцеговина",
					"value": "&#127463;&#127462;"
				},
				{
					"title": "Флаг: Барбадос",
					"value": "&#127463;&#127463;"
				},
				{
					"title": "Флаг: Бангладеш",
					"value": "&#127463;&#127465;"
				},
				{
					"title": "Флаг: Бельгия",
					"value": "&#127463;&#127466;"
				},
				{
					"title": "Флаг: Буркина-Фасо",
					"value": "&#127463;&#127467;"
				},
				{
					"title": "Флаг: Болгария",
					"value": "&#127463;&#127468;"
				},
				{
					"title": "Флаг: Бахрейн",
					"value": "&#127463;&#127469;"
				},
				{
					"title": "Флаг: Бурунди",
					"value": "&#127463;&#127470;"
				},
				{
					"title": "Флаг: Бенин",
					"value": "&#127463;&#127471;"
				},
				{
					"title": "Флаг: Сен-Бартелеми",
					"value": "&#127463;&#127473;"
				},
				{
					"title": "Флаг: Бермудские О-Ва",
					"value": "&#127463;&#127474;"
				},
				{
					"title": "Флаг: Бруней",
					"value": "&#127463;&#127475;"
				},
				{
					"title": "Флаг: Боливия",
					"value": "&#127463;&#127476;"
				},
				{
					"title": "Флаг: Бонэйр, Синт-Эстатиус и Саба",
					"value": "&#127463;&#127478;"
				},
				{
					"title": "Флаг: Бразилия",
					"value": "&#127463;&#127479;"
				},
				{
					"title": "Флаг: Багамы",
					"value": "&#127463;&#127480;"
				},
				{
					"title": "Флаг: Бутан",
					"value": "&#127463;&#127481;"
				},
				{
					"title": "Флаг: О-В Буве",
					"value": "&#127463;&#127483;"
				},
				{
					"title": "Флаг: Ботсвана",
					"value": "&#127463;&#127484;"
				},
				{
					"title": "Флаг: Беларусь",
					"value": "&#127463;&#127486;"
				},
				{
					"title": "Флаг: Белиз",
					"value": "&#127463;&#127487;"
				},
				{
					"title": "Флаг: Канада",
					"value": "&#127464;&#127462;"
				},
				{
					"title": "Флаг: Кокосовые О-Ва",
					"value": "&#127464;&#127464;"
				},
				{
					"title": "Флаг: Конго - Киншаса",
					"value": "&#127464;&#127465;"
				},
				{
					"title": "Флаг: Центрально-Африканская Республика",
					"value": "&#127464;&#127467;"
				},
				{
					"title": "Флаг: Конго - Браззавиль",
					"value": "&#127464;&#127468;"
				},
				{
					"title": "Флаг: Швейцария",
					"value": "&#127464;&#127469;"
				},
				{
					"title": "Флаг: Кот-Д’ивуар",
					"value": "&#127464;&#127470;"
				},
				{
					"title": "Флаг: О-Ва Кука",
					"value": "&#127464;&#127472;"
				},
				{
					"title": "Флаг: Чили",
					"value": "&#127464;&#127473;"
				},
				{
					"title": "Флаг: Камерун",
					"value": "&#127464;&#127474;"
				},
				{
					"title": "Флаг: Китай",
					"value": "&#127464;&#127475;"
				},
				{
					"title": "Флаг: Колумбия-",
					"value": "&#127464;&#127476;"
				},
				{
					"title": "Флаг: О-В Клиппертон",
					"value": "&#127464;&#127477;"
				},
				{
					"title": "Флаг: Коста-Рика",
					"value": "&#127464;&#127479;"
				},
				{
					"title": "Флаг: Куба",
					"value": "&#127464;&#127482;"
				},
				{
					"title": "Флаг: Кабо-Верде",
					"value": "&#127464;&#127483;"
				},
				{
					"title": "Флаг: Кюрасао",
					"value": "&#127464;&#127484;"
				},
				{
					"title": "Флаг: О-В Рождества",
					"value": "&#127464;&#127485;"
				},
				{
					"title": "Флаг: Кипр",
					"value": "&#127464;&#127486;"
				},
				{
					"title": "Флаг: Чехия",
					"value": "&#127464;&#127487;"
				},
				{
					"title": "Флаг: Германия",
					"value": "&#127465;&#127466;"
				},
				{
					"title": "Флаг: Диего-Гарсия",
					"value": "&#127465;&#127468;"
				},
				{
					"title": "Флаг: Джибути",
					"value": "&#127465;&#127471;"
				},
				{
					"title": "Флаг: Дания",
					"value": "&#127465;&#127472;"
				},
				{
					"title": "Флаг: Доминика",
					"value": "&#127465;&#127474;"
				},
				{
					"title": "Флаг: Доминиканская Республика",
					"value": "&#127465;&#127476;"
				},
				{
					"title": "Флаг: Алжир",
					"value": "&#127465;&#127487;"
				},
				{
					"title": "Флаг: Сеута и Мелилья",
					"value": "&#127466;&#127462;"
				},
				{
					"title": "Флаг: Эквадор",
					"value": "&#127466;&#127464;"
				},
				{
					"title": "Флаг: Эстония",
					"value": "&#127466;&#127466;"
				},
				{
					"title": "Флаг: Египет",
					"value": "&#127466;&#127468;"
				},
				{
					"title": "Флаг: Западная Сахара",
					"value": "&#127466;&#127469;"
				},
				{
					"title": "Флаг: Эритрея",
					"value": "&#127466;&#127479;"
				},
				{
					"title": "Флаг: Испания",
					"value": "&#127466;&#127480;"
				},
				{
					"title": "Флаг: Эфиопия",
					"value": "&#127466;&#127481;"
				},
				{
					"title": "Флаг: Европейский Союз",
					"value": "&#127466;&#127482;"
				},
				{
					"title": "Флаг: Финляндия",
					"value": "&#127467;&#127470;"
				},
				{
					"title": "Флаг: Фиджи",
					"value": "&#127467;&#127471;"
				},
				{
					"title": "Флаг: Фолклендские О-Ва",
					"value": "&#127467;&#127472;"
				},
				{
					"title": "Флаг: Федеративные Штаты Микронезии",
					"value": "&#127467;&#127474;"
				},
				{
					"title": "Флаг: Фарерские О-Ва",
					"value": "&#127467;&#127476;"
				},
				{
					"title": "Флаг: Франция",
					"value": "&#127467;&#127479;"
				},
				{
					"title": "Флаг: Габон",
					"value": "&#127468;&#127462;"
				},
				{
					"title": "Флаг: Великобритания",
					"value": "&#127468;&#127463;"
				},
				{
					"title": "Флаг: Гренада",
					"value": "&#127468;&#127465;"
				},
				{
					"title": "Флаг: Грузия",
					"value": "&#127468;&#127466;"
				},
				{
					"title": "Флаг: Французская Гвиана",
					"value": "&#127468;&#127467;"
				},
				{
					"title": "Флаг: Гернси",
					"value": "&#127468;&#127468;"
				},
				{
					"title": "Флаг: Гана",
					"value": "&#127468;&#127469;"
				},
				{
					"title": "Флаг: Гибралтар",
					"value": "&#127468;&#127470;"
				},
				{
					"title": "Флаг: Гренландия",
					"value": "&#127468;&#127473;"
				},
				{
					"title": "Флаг: Гамбия",
					"value": "&#127468;&#127474;"
				},
				{
					"title": "Флаг: Гвинея",
					"value": "&#127468;&#127475;"
				},
				{
					"title": "Флаг: Гваделупа",
					"value": "&#127468;&#127477;"
				},
				{
					"title": "Флаг: Экваториальная Гвинея",
					"value": "&#127468;&#127478;"
				},
				{
					"title": "Флаг: Греция",
					"value": "&#127468;&#127479;"
				},
				{
					"title": "Флаг: Южная Георгия и Южные Сандвичевы О-Ва",
					"value": "&#127468;&#127480;"
				},
				{
					"title": "Флаг: Гватемала",
					"value": "&#127468;&#127481;"
				},
				{
					"title": "Флаг: Гуам",
					"value": "&#127468;&#127482;"
				},
				{
					"title": "Флаг: Гвинея-Бисау",
					"value": "&#127468;&#127484;"
				},
				{
					"title": "Флаг: Гайана",
					"value": "&#127468;&#127486;"
				},
				{
					"title": "Флаг: Гонконг (сар)",
					"value": "&#127469;&#127472;"
				},
				{
					"title": "Флаг: О-Ва Херд и Макдональд",
					"value": "&#127469;&#127474;"
				},
				{
					"title": "Флаг: Гондурас",
					"value": "&#127469;&#127475;"
				},
				{
					"title": "Флаг: Хорватия",
					"value": "&#127469;&#127479;"
				},
				{
					"title": "Флаг: Гаити",
					"value": "&#127469;&#127481;"
				},
				{
					"title": "Флаг: Венгрия",
					"value": "&#127469;&#127482;"
				},
				{
					"title": "Флаг: Канарские О-Ва",
					"value": "&#127470;&#127464;"
				},
				{
					"title": "Флаг: Индонезия",
					"value": "&#127470;&#127465;"
				},
				{
					"title": "Флаг: Ирландия",
					"value": "&#127470;&#127466;"
				},
				{
					"title": "Флаг: Израиль",
					"value": "&#127470;&#127473;"
				},
				{
					"title": "Флаг: О-В Мэн",
					"value": "&#127470;&#127474;"
				},
				{
					"title": "Флаг: Индия",
					"value": "&#127470;&#127475;"
				},
				{
					"title": "Флаг: Британская Территория в Индийском Океане",
					"value": "&#127470;&#127476;"
				},
				{
					"title": "Флаг: Ирак",
					"value": "&#127470;&#127478;"
				},
				{
					"title": "Флаг: Иран",
					"value": "&#127470;&#127479;"
				},
				{
					"title": "Флаг: Исландия",
					"value": "&#127470;&#127480;"
				},
				{
					"title": "Флаг: Италия",
					"value": "&#127470;&#127481;"
				},
				{
					"title": "Флаг: Джерси",
					"value": "&#127471;&#127466;"
				},
				{
					"title": "Флаг: Ямайка",
					"value": "&#127471;&#127474;"
				},
				{
					"title": "Флаг: Иордания",
					"value": "&#127471;&#127476;"
				},
				{
					"title": "Флаг: Япония",
					"value": "&#127471;&#127477;"
				},
				{
					"title": "Флаг: Кения",
					"value": "&#127472;&#127466;"
				},
				{
					"title": "Флаг: Киргизия",
					"value": "&#127472;&#127468;"
				},
				{
					"title": "Флаг: Камбоджа",
					"value": "&#127472;&#127469;"
				},
				{
					"title": "Флаг: Кирибати",
					"value": "&#127472;&#127470;"
				},
				{
					"title": "Флаг: Коморы",
					"value": "&#127472;&#127474;"
				},
				{
					"title": "Флаг: Сент-Китс и Невис",
					"value": "&#127472;&#127475;"
				},
				{
					"title": "Флаг: Кндр",
					"value": "&#127472;&#127477;"
				},
				{
					"title": "Флаг: Республика Корея",
					"value": "&#127472;&#127479;"
				},
				{
					"title": "Флаг: Кувейт",
					"value": "&#127472;&#127484;"
				},
				{
					"title": "Флаг: О-Ва Кайман",
					"value": "&#127472;&#127486;"
				},
				{
					"title": "Флаг: Казахстан",
					"value": "&#127472;&#127487;"
				},
				{
					"title": "Флаг: Лаос",
					"value": "&#127473;&#127462;"
				},
				{
					"title": "Флаг: Ливан",
					"value": "&#127473;&#127463;"
				},
				{
					"title": "Флаг: Сент-Люсия",
					"value": "&#127473;&#127464;"
				},
				{
					"title": "Флаг: Лихтенштейн",
					"value": "&#127473;&#127470;"
				},
				{
					"title": "Флаг: Шри-Ланка",
					"value": "&#127473;&#127472;"
				},
				{
					"title": "Флаг: Либерия",
					"value": "&#127473;&#127479;"
				},
				{
					"title": "Флаг: Лесото",
					"value": "&#127473;&#127480;"
				},
				{
					"title": "Флаг: Литва",
					"value": "&#127473;&#127481;"
				},
				{
					"title": "Флаг: Люксембург",
					"value": "&#127473;&#127482;"
				},
				{
					"title": "Флаг: Латвия",
					"value": "&#127473;&#127483;"
				},
				{
					"title": "Флаг: Ливия",
					"value": "&#127473;&#127486;"
				},
				{
					"title": "Флаг: Марокко",
					"value": "&#127474;&#127462;"
				},
				{
					"title": "Флаг: Монако",
					"value": "&#127474;&#127464;"
				},
				{
					"title": "Флаг: Молдова",
					"value": "&#127474;&#127465;"
				},
				{
					"title": "Флаг: Черногория",
					"value": "&#127474;&#127466;"
				},
				{
					"title": "Флаг: Сен-Мартен",
					"value": "&#127474;&#127467;"
				},
				{
					"title": "Флаг: Мадагаскар",
					"value": "&#127474;&#127468;"
				},
				{
					"title": "Флаг: Маршалловы О-Ва",
					"value": "&#127474;&#127469;"
				},
				{
					"title": "Флаг: Северная Македония",
					"value": "&#127474;&#127472;"
				},
				{
					"title": "Флаг: Мали",
					"value": "&#127474;&#127473;"
				},
				{
					"title": "Флаг: Мьянма (Бирма)",
					"value": "&#127474;&#127474;"
				},
				{
					"title": "Флаг: Монголия",
					"value": "&#127474;&#127475;"
				},
				{
					"title": "Флаг: Макао (Сар)",
					"value": "&#127474;&#127476;"
				},
				{
					"title": "Флаг: Северные Марианские О-Ва",
					"value": "&#127474;&#127477;"
				},
				{
					"title": "Флаг: Мартиника",
					"value": "&#127474;&#127478;"
				},
				{
					"title": "Флаг: Мавритания",
					"value": "&#127474;&#127479;"
				},
				{
					"title": "Флаг: Монтсеррат",
					"value": "&#127474;&#127480;"
				},
				{
					"title": "Флаг: Мальта",
					"value": "&#127474;&#127481;"
				},
				{
					"title": "Флаг: Маврикий",
					"value": "&#127474;&#127482;"
				},
				{
					"title": "Флаг: Мальдивы",
					"value": "&#127474;&#127483;"
				},
				{
					"title": "Флаг: Малави",
					"value": "&#127474;&#127484;"
				},
				{
					"title": "Флаг: Мексика",
					"value": "&#127474;&#127485;"
				},
				{
					"title": "Флаг: Малайзия",
					"value": "&#127474;&#127486;"
				},
				{
					"title": "Флаг: Мозамбик",
					"value": "&#127474;&#127487;"
				},
				{
					"title": "Флаг: Намибия",
					"value": "&#127475;&#127462;"
				},
				{
					"title": "Флаг: Новая Каледония",
					"value": "&#127475;&#127464;"
				},
				{
					"title": "Флаг: Нигер",
					"value": "&#127475;&#127466;"
				},
				{
					"title": "Флаг: О-В Норфолк",
					"value": "&#127475;&#127467;"
				},
				{
					"title": "Флаг: Нигерия",
					"value": "&#127475;&#127468;"
				},
				{
					"title": "Флаг: Никарагуа",
					"value": "&#127475;&#127470;"
				},
				{
					"title": "Флаг: Нидерланды",
					"value": "&#127475;&#127473;"
				},
				{
					"title": "Флаг: Норвегия",
					"value": "&#127475;&#127476;"
				},
				{
					"title": "Флаг: Непал",
					"value": "&#127475;&#127477;"
				},
				{
					"title": "Флаг: Науру",
					"value": "&#127475;&#127479;"
				},
				{
					"title": "Флаг: Ниуэ",
					"value": "&#127475;&#127482;"
				},
				{
					"title": "Флаг: Новая Зеландия",
					"value": "&#127475;&#127487;"
				},
				{
					"title": "Флаг: Оман",
					"value": "&#127476;&#127474;"
				},
				{
					"title": "Флаг: Панама",
					"value": "&#127477;&#127462;"
				},
				{
					"title": "Флаг: Перу",
					"value": "&#127477;&#127466;"
				},
				{
					"title": "Флаг: Французская Полинезия",
					"value": "&#127477;&#127467;"
				},
				{
					"title": "Флаг: Папуа — Новая Гвинея",
					"value": "&#127477;&#127468;"
				},
				{
					"title": "Флаг: Филиппины",
					"value": "&#127477;&#127469;"
				},
				{
					"title": "Флаг: Пакистан",
					"value": "&#127477;&#127472;"
				},
				{
					"title": "Флаг: Польша",
					"value": "&#127477;&#127473;"
				},
				{
					"title": "Флаг: Сен-Пьер и Микелон",
					"value": "&#127477;&#127474;"
				},
				{
					"title": "Флаг: О-Ва Питкэрн",
					"value": "&#127477;&#127475;"
				},
				{
					"title": "Флаг: Пуэрто-Рико",
					"value": "&#127477;&#127479;"
				},
				{
					"title": "Флаг: Палестинские Территории",
					"value": "&#127477;&#127480;"
				},
				{
					"title": "Флаг: Португалия",
					"value": "&#127477;&#127481;"
				},
				{
					"title": "Флаг: Палау",
					"value": "&#127477;&#127484;"
				},
				{
					"title": "Флаг: Парагвай",
					"value": "&#127477;&#127486;"
				},
				{
					"title": "Флаг: Катар",
					"value": "&#127478;&#127462;"
				},
				{
					"title": "Флаг: Реюньон",
					"value": "&#127479;&#127466;"
				},
				{
					"title": "Флаг: Румыния",
					"value": "&#127479;&#127476;"
				},
				{
					"title": "Флаг: Сербия",
					"value": "&#127479;&#127480;"
				},
				{
					"title": "Флаг: Россия",
					"value": "&#127479;&#127482;"
				},
				{
					"title": "Флаг: Руанда",
					"value": "&#127479;&#127484;"
				},
				{
					"title": "Флаг: Саудовская Аравия",
					"value": "&#127480;&#127462;"
				},
				{
					"title": "Флаг: Соломоновы О-Ва",
					"value": "&#127480;&#127463;"
				},
				{
					"title": "Флаг: Сейшельские О-Ва",
					"value": "&#127480;&#127464;"
				},
				{
					"title": "Флаг: Судан",
					"value": "&#127480;&#127465;"
				},
				{
					"title": "Флаг: Швеция",
					"value": "&#127480;&#127466;"
				},
				{
					"title": "Флаг: Сингапур",
					"value": "&#127480;&#127468;"
				},
				{
					"title": "Флаг: О-В Св. Елены",
					"value": "&#127480;&#127469;"
				},
				{
					"title": "Флаг: Словения",
					"value": "&#127480;&#127470;"
				},
				{
					"title": "Флаг: Шпицберген и Ян-Майен",
					"value": "&#127480;&#127471;"
				},
				{
					"title": "Флаг: Словакия",
					"value": "&#127480;&#127472;"
				},
				{
					"title": "Флаг: Сьерра-Леоне",
					"value": "&#127480;&#127473;"
				},
				{
					"title": "Флаг: Сан-Марино",
					"value": "&#127480;&#127474;"
				},
				{
					"title": "Флаг: Сенегал",
					"value": "&#127480;&#127475;"
				},
				{
					"title": "Флаг: Сомали",
					"value": "&#127480;&#127476;"
				},
				{
					"title": "Флаг: Суринам",
					"value": "&#127480;&#127479;"
				},
				{
					"title": "Флаг: Южный Судан",
					"value": "&#127480;&#127480;"
				},
				{
					"title": "Флаг: Сан-Томе и Принсипи",
					"value": "&#127480;&#127481;"
				},
				{
					"title": "Флаг: Сальвадор",
					"value": "&#127480;&#127483;"
				},
				{
					"title": "Флаг: Синт-Мартен",
					"value": "&#127480;&#127485;"
				},
				{
					"title": "Флаг: Сирия",
					"value": "&#127480;&#127486;"
				},
				{
					"title": "Флаг: Эсватини",
					"value": "&#127480;&#127487;"
				},
				{
					"title": "Флаг: Тристан-Да-Кунья",
					"value": "&#127481;&#127462;"
				},
				{
					"title": "Флаг: Тёркс и Кайкос",
					"value": "&#127481;&#127464;"
				},
				{
					"title": "Флаг: Чад",
					"value": "&#127481;&#127465;"
				},
				{
					"title": "Флаг: Французские Южные Территории",
					"value": "&#127481;&#127467;"
				},
				{
					"title": "Флаг: Того",
					"value": "&#127481;&#127468;"
				},
				{
					"title": "Флаг: Таиланд",
					"value": "&#127481;&#127469;"
				},
				{
					"title": "Флаг: Таджикистан",
					"value": "&#127481;&#127471;"
				},
				{
					"title": "Флаг: Токелау",
					"value": "&#127481;&#127472;"
				},
				{
					"title": "Флаг: Восточный Тимор",
					"value": "&#127481;&#127473;"
				},
				{
					"title": "Флаг: Туркменистан",
					"value": "&#127481;&#127474;"
				},
				{
					"title": "Флаг: Тунис",
					"value": "&#127481;&#127475;"
				},
				{
					"title": "Флаг: Тонга",
					"value": "&#127481;&#127476;"
				},
				{
					"title": "Флаг: Турция",
					"value": "&#127481;&#127479;"
				},
				{
					"title": "Флаг: Тринидад и Тобаго",
					"value": "&#127481;&#127481;"
				},
				{
					"title": "Флаг: Тувалу",
					"value": "&#127481;&#127483;"
				},
				{
					"title": "Флаг: Тайвань",
					"value": "&#127481;&#127484;"
				},
				{
					"title": "Флаг: Танзания",
					"value": "&#127481;&#127487;"
				},
				{
					"title": "Флаг: Украина",
					"value": "&#127482;&#127462;"
				},
				{
					"title": "Флаг: Уганда",
					"value": "&#127482;&#127468;"
				},
				{
					"title": "Флаг: Внешние Малые О-Ва (США)",
					"value": "&#127482;&#127474;"
				},
				{
					"title": "Флаг: Организация Объединенных Наций",
					"value": "&#127482;&#127475;"
				},
				{
					"title": "Флаг: Соединенные Штаты",
					"value": "&#127482;&#127480;"
				},
				{
					"title": "Флаг: Уругвай",
					"value": "&#127482;&#127486;"
				},
				{
					"title": "Флаг: Узбекистан",
					"value": "&#127482;&#127487;"
				},
				{
					"title": "Флаг: Ватикан",
					"value": "&#127483;&#127462;"
				},
				{
					"title": "Флаг: Сент-Винсент и Гренадины",
					"value": "&#127483;&#127464;"
				},
				{
					"title": "Флаг: Венесуэла",
					"value": "&#127483;&#127466;"
				},
				{
					"title": "Флаг: Виргинские О-Ва (Великобритания)",
					"value": "&#127483;&#127468;"
				},
				{
					"title": "Флаг: Виргинские О-Ва (США)",
					"value": "&#127483;&#127470;"
				},
				{
					"title": "Флаг: Вьетнам",
					"value": "&#127483;&#127475;"
				},
				{
					"title": "Флаг: Вануату",
					"value": "&#127483;&#127482;"
				},
				{
					"title": "Флаг: Уоллис и Футуна",
					"value": "&#127484;&#127467;"
				},
				{
					"title": "Флаг: Самоа",
					"value": "&#127484;&#127480;"
				},
				{
					"title": "Флаг: Косово",
					"value": "&#127485;&#127472;"
				},
				{
					"title": "Флаг: Йемен",
					"value": "&#127486;&#127466;"
				},
				{
					"title": "Флаг: Майотта",
					"value": "&#127486;&#127481;"
				},
				{
					"title": "Флаг: Южно-Африканская Республика",
					"value": "&#127487;&#127462;"
				},
				{
					"title": "Флаг: Замбия",
					"value": "&#127487;&#127474;"
				},
				{
					"title": "Флаг: Зимбабве",
					"value": "&#127487;&#127484;"
				},
				{
					"title": "Флаг: Англия",
					"value": "&#127988;&#917607;&#917602;&#917605;&#917614;&#917607;&#917631;"
				},
				{
					"title": "Флаг: Шотландия",
					"value": "&#127988;&#917607;&#917602;&#917619;&#917603;&#917620;&#917631;"
				},
				{
					"title": "Флаг: Уэльс",
					"value": "&#127988;&#917607;&#917602;&#917623;&#917612;&#917619;&#917631;"
				},
			]
		}
	];

	const main = (emotics) => {

		/**
		 * Блок вставки плагина
		 */
		const plugin = document.querySelector("[data-plugin=emoji]");

		/**
		 * Опции
		 */
		let h3Title,
			pContent,
			hrOption = false,
			h3Option = false,
			pOption = false,
			url = document.currentScript.src;
		url = new URL(url);
		if(!plugin){
			return !1;
		}

		/**
		 * Подключаем стили
		 */
		const regex = /js\/emoji(?:\.min)?\.js/g;
		const subst = `css/emoji.min.css`;
		const css = url.origin + url.pathname.replace(regex, subst) + "?" + (new Date()).getTime();
		const link = document.createElement("link");
		link.rel = "stylesheet";
		link.type = "text/css";
		link.href = css;

		/**
		 * Блок для всего плагина
		 */
		const block = document.createElement("div");
		block.classList.add("emoji-wrapp");

		/**
		 * Блок для табов
		 */
		const tabs = document.createElement("div");
		tabs.classList.add("emoji-tabs");

		/**
		 * Блок для иконок
		 */
		const content = document.createElement("div");
		content.classList.add("emoji-content");
		if(url.hash) {
			let strOptions = `?` + url.hash.replace(/#/g, ``);
			strOptions = new URLSearchParams(strOptions);
			strOptions.has(`hr`) && (
				hrOption = (strOptions.get(`hr`) === 'true')
			);
			strOptions.has(`title`) && (
				h3Option = (strOptions.get(`title`) === 'true')
			);
			strOptions.has(`content`) && (
				pOption = (strOptions.get(`content`) === 'true')
			);
		}
		hrOption && plugin.append(document.createElement("hr"));
		h3Option && (
			h3Title = document.createElement("h3"),
			h3Title.innerText = "Включена поддержка текстовых EMOJI",
			h3Title.classList.add("red"),
			plugin.append(h3Title)
		);
		pOption && (
			pContent = document.createElement("p"),
			pContent.innerText = "Кликните по иконке Emoji и она скопируется в буфер.",
			plugin.append(pContent)
		);

		/**
		 * Построение
		 */
		let active = !0;
		for(let index in emotics){
			let emo = emotics[index];
			let title = emo.title;
			let id = emo.id;
			// Tab
			let tab = document.createElement("div");
			tab.classList.add("tabs-item");
			// Label
			let label = document.createElement("label");
			label.innerText = title;
			label.setAttribute('for', "emoji-radio-" + id);
			// Input
			let input = document.createElement("input");
			input.id = "emoji-radio-" + id;
			input.type = "radio";
			input.name = "emoji";
			input.value = id;
			// Emoji`s
			let content_emoji = document.createElement("div");
			content_emoji.classList.add("tabs-content");
			content_emoji.classList.add("clearfix");
			content_emoji.id = "emoji-" + id;
			// Title
			let h = document.createElement("h2");
			h.classList.add("text-center");
			h.innerText = title;
			// Icons wrapp
			let wrapp = document.createElement("div");
			wrapp.classList.add("emoji-icons-wrapp");
			active && (
				tab.classList.add("active"),
				content_emoji.classList.add("active"),
				input.setAttribute("checked", "checked")
			);

			/**
			 * Заполнение
			 */
			for(let icon_index in emo.icons){
				let ttl = emo.icons[icon_index].title;
				let emoji = emo.icons[icon_index].value;
				let span = document.createElement("span");
				span.classList.add("emoji--icon");
				span.innerHTML = emoji;
				span.setAttribute("data-title", span.innerText);
				span.setAttribute("title", span.innerText);
				ttl && (
					span.setAttribute("title", ttl),
					span.setAttribute("data-title", ttl)
				)
				span.setAttribute("data-copy", "");
				wrapp.append(span);
			}
			label.append(input);
			tab.append(label);
			tabs.append(tab);
			let out = document.createElement('span');
			out.classList.add('out');
			content_emoji.append(out);
			content_emoji.append(h);
			content_emoji.append(wrapp);
			content.append(content_emoji);
			active = !1;
		}
		block.append(tabs);
		block.append(content);
		plugin.append(block);
		plugin.append(link);
	};

	/**
	 * Очистка после копирования
	 * если нет поддержки navigator.clipboard
	 */
	function clearSelection(span){
		if (window.getSelection) {
			window.getSelection().removeAllRanges();
		} else if (document.selection) {
			document.selection.empty();
		}
		// span.setAttribute("data-copy", "СКОПИРОВАНО");
		setTimeout(function(){
			span.classList.remove('copy');
			span.setAttribute("data-copy", "");
		}, 500);
	}

	/**
	 * Клик по иконке
	 * Копирование
	 */
	document.addEventListener('click', async function(e){
		if(e.target.classList.contains('emoji--icon')){
			let span = e.target,
				html = "",
				out = span.closest(".tabs-content").querySelector('span.out'),
				rng;
			if(navigator.clipboard){
				span.classList.remove('copy');
				span.classList.remove('error');
				span.classList.add('copy');
				navigator.clipboard.writeText(span.firstChild.nodeValue).then(() => {
					out.innerHTML = "СКОПИРОВАНО: " + span.firstChild.nodeValue;
					setTimeout(() => {
						span.classList.remove('copy');
						out.innerHTML = "";
					}, 500);
				}).catch(() => {
					out.innerHTML = "ОШИБКА";
					span.classList.remove('copy');
					span.classList.add('error');
					setTimeout(() => {
						span.classList.remove('error');
						out.innerHTML = "";
					}, 1000);
				});
			}else{
				span.classList.remove('copy');
				span.classList.remove('error');
				span.classList.add('copy');
				let rnd, sel
				if (document.createRange) {
					rng = document.createRange();
					rng.selectNode(span)
					sel = window.getSelection();
					sel.removeAllRanges();
					sel.addRange(rng);
					document.execCommand("copy");
					clearSelection(span);
				} else {
					rng = document.body.createTextRange();
					rng.moveToElementText(target);
					rng.select();
					document.execCommand("copy");
					clearSelection(span);
				}
			}
		}
	});

	/**
	 * Клик по табу
	 */
	document.addEventListener("input", function(e){
		if(e.target.name && e.target.name == "emoji"){
			e.preventDefault();
			let input = e.target;
			let value = e.target.value;
			let wrap = input.closest('.emoji-wrapp');
			let emoji_tabs = input.closest('.emoji-tabs');
			let tab = input.closest('.tabs-item');
			let tabs_item = [...emoji_tabs.querySelectorAll('.tabs-item')];
			let tabs_content = [...wrap.querySelectorAll('.tabs-content')];
			let tab_active = emoji_tabs.querySelectorAll('.active');
			tabs_item.forEach(function(a, b, c){
				a.classList.remove('active');
			});
			tabs_content.forEach(function(a, b, c){
				a.classList.remove('active');
			});
			let tb = wrap.querySelector("#emoji-" + value);
			tb && (
				tb.classList.add('active'),
				tab.classList.add('active'),
				window.location.hash = value,
				wrap.scrollIntoView({ behavior: 'smooth' })
			);
			return !1;
		}
	});

	main(emojies);

	/**
	 * location.hash при загрузке
	 * Не идеальна. Нужна дороботка
	 */
	let idHash = window.location.hash;
	if(idHash){
		idHash = idHash.replace(/#/g, ``);
		let inp = window.document.querySelector("#emoji-radio-" + idHash);
		if(Boolean(inp)){
			if(inp.tagName == 'INPUT'){
				inp.checked = true;
				let event = new Event('input', {
					bubbles: true,
					cancelable: true,
					target: inp
				});
				inp.dispatchEvent(event);
			}
		}
	}

}());